{
    "id": "group51",
    "words": [
      {
        "id": "g51w1",
        "word": "resplendent",
        "meaning": "Shining brilliantly; resplendent in appearance.",
        "examples": [
          "The queen looked resplendent in her jewel-encrusted gown.",
          "The sun rose over the ocean, casting a resplendent glow on the waves."
        ]
      },
      {
        "id": "g51w1",
        "word": "restitution",
        "meaning": "The restoration of something lost or stolen to its proper owner. Recompense for injury or loss.",
        "examples": [
          "The court ordered him to make restitution for the damage he caused.",
          "They demanded restitution for the stolen artifacts."
        ]
      },
      {
        "id": "g51w3",
        "word": "restive",
        "meaning": "(Of a person) unable to keep still or silent and becoming increasingly difficult to control, especially because of impatience, dissatisfaction, or boredom. (Of a horse) stubbornly refusing to advance.",
        "examples": [
          "The audience grew restive during the long, boring speech.",
          "The restive horse kept pawing the ground."
        ]
      },
      {
        "id": "g51w4",
        "word": "restrictive",
        "meaning": "Imposing restrictions or limitations on someone's actions or movements.",
        "examples": [
          "The new zoning laws are quite restrictive on building heights.",
          "She found the dress to be too restrictive for dancing."
        ]
      },
      {
        "id": "g51w5",
        "word": "resurgence",
        "meaning": "An increase or revival after a period of little activity, popularity, or occurrence.",
        "examples": [
          "There has been a resurgence of interest in vintage fashion.",
          "The band experienced a sudden resurgence in popularity after their song was featured in a film."
        ]
      },
      {
        "id": "g51w6",
        "word": "resurgent",
        "meaning": "Increasing or reviving after a period of little activity, popularity, or occurrence.",
        "examples": [
          "The resurgent economy created new job opportunities.",
          "The resurgent national pride was evident after the Olympic victory."
        ]
      },
      {
        "id": "g51w7",
        "word": "resurrect",
        "meaning": "To restore (a dead person) to life. To revive the practice, use, or memory of (something).",
        "examples": [
          "The old traditions were resurrected for the annual festival.",
          "Scientists are hoping to resurrect extinct species through genetic engineering."
        ]
      },
      {
        "id": "g51w8",
        "word": "retaliate",
        "meaning": "To make an attack or assault in return for a similar attack.",
        "examples": [
          "The country threatened to retaliate if its borders were violated.",
          "She felt compelled to retaliate after his rude remarks."
        ]
      },
      {
        "id": "g51w9",
        "word": "retard",
        "meaning": "To delay or hold back in terms of progress, development, or accomplishment.",
        "examples": [
          "Lack of funding will retard the progress of the research.",
          "Certain chemicals can retard the growth of weeds."
        ]
      },
      {
        "id": "g51w10",
        "word": "reticent",
        "meaning": "Not revealing one's thoughts or feelings readily.",
        "examples": [
          "He was reticent about his past, rarely sharing personal details.",
          "The witness remained reticent, refusing to answer any questions."
        ]
      },
      {
        "id": "g51w11",
        "word": "retiring",
        "meaning": "Shy and fond of solitude.",
        "examples": [
          "Despite her success, she remained a retiring and humble person.",
          "His retiring nature made him prefer quiet evenings at home."
        ]
      },
      {
        "id": "g51w12",
        "word": "retort",
        "meaning": "A sharp, clever, or witty reply.",
        "examples": [
          "She delivered a scathing retort to his insult.",
          "His quick retort left the heckler speechless."
        ]
      },
      {
        "id": "g51w13",
        "word": "retract",
        "meaning": "To draw back or in. To withdraw (a statement or accusation) as untrue or unjustified.",
        "examples": [
          "The cat retracted its claws into its paws.",
          "He was forced to retract his defamatory statements."
        ]
      },
      {
        "id": "g51w14",
        "word": "retrenchment",
        "meaning": "The reduction of costs or spending in response to economic difficulty.",
        "examples": [
          "The company announced a period of retrenchment to cut expenses.",
          "Job losses were a consequence of the industry's retrenchment."
        ]
      },
      {
        "id": "g51w15",
        "word": "retrospect",
        "meaning": "A survey or review of a past course of events or period of time.",
        "examples": [
          "In retrospect, I should have listened to her advice.",
          "Looking in retrospect, the decision seems obvious now."
        ]
      },
      {
        "id": "g51w16",
        "word": "retrospection",
        "meaning": "The action of looking back on or reviewing past events or situations, especially those in one's own life.",
        "examples": [
          "The book is a deep retrospection of the author's youth.",
          "His new album is a powerful retrospection of his career."
        ]
      },
      {
        "id": "g51w17",
        "word": "retrospective",
        "meaning": "Looking back on or dealing with past events or situations.",
        "examples": [
          "The museum is holding a retrospective exhibition of her work.",
          "She conducted a retrospective analysis of the project's failures."
        ]
      },
      {
        "id": "g51w18",
        "word": "revamp",
        "meaning": "To give new and improved form, structure, or appearance to.",
        "examples": [
          "They decided to revamp their marketing strategy to attract new customers.",
          "The old theater underwent a major revamp to modernize its facilities."
        ]
      },
      {
        "id": "g51w19",
        "word": "revanche",
        "meaning": "A revenge, especially by a nation to recover lost territory.",
        "examples": [
          "The nation sought revanche for its defeat in the previous war.",
          "The concept of revanche often fuels political tensions."
        ]
      },
      {
        "id": "g51w20",
        "word": "reverberate",
        "meaning": "(Of a sound or effect) be repeated several times as an echo. (Of a place) appear to vibrate or be filled with a loud sound.",
        "examples": [
          "The sound of the explosion reverberated through the valley.",
          "His words continued to reverberate in her mind long after he left."
        ]
      },
      {
        "id": "g51w21",
        "word": "reverberating",
        "meaning": "(Of a sound or effect) being repeated several times as an echo; resounding.",
        "examples": [
          "The reverberating applause filled the concert hall.",
          "The news had a reverberating impact across the entire industry."
        ]
      },
      {
        "id": "g51w22",
        "word": "revere",
        "meaning": "To feel deep respect or admiration for (something).",
        "examples": [
          "Many cultures revere their ancestors.",
          "He was revered as a national hero for his bravery."
        ]
      },
      {
        "id": "g51w23",
        "word": "reverence",
        "meaning": "Deep respect for someone or something.",
        "examples": [
          "The audience listened in reverence as the wise elder spoke.",
          "He treated ancient texts with utmost reverence."
        ]
      },
      {
        "id": "g51w24",
        "word": "reverent",
        "meaning": "Feeling or showing deep and solemn respect.",
        "examples": [
          "The worshippers approached the altar with reverent silence.",
          "He spoke in a reverent tone about his mentor."
        ]
      },
      {
        "id": "g51w25",
        "word": "reverie",
        "meaning": "A state of being pleasantly lost in one's thoughts; a daydream.",
        "examples": [
          "She was lost in a reverie, staring out the window.",
          "His afternoon reverie was interrupted by the ringing phone."
        ]
      },
      {
        "id": "g51w26",
        "word": "revert",
        "meaning": "To return to (a previous state, practice, topic, etc.).",
        "examples": [
          "After the renovations, the house reverted to its original charm.",
          "He tends to revert to old habits when he's stressed."
        ]
      },
      {
        "id": "g51w27",
        "word": "revile",
        "meaning": "To criticize in an abusive or angrily insulting manner.",
        "examples": [
          "He was reviled by the public for his controversial opinions.",
          "Critics reviled the play as a complete failure."
        ]
      },
      {
        "id": "g51w28",
        "word": "reviled",
        "meaning": "Criticized in an abusive or angrily insulting manner.",
        "examples": [
          "The politician was widely reviled for his role in the scandal.",
          "She felt unjustly reviled by her colleagues."
        ]
      },
      {
        "id": "g51w29",
        "word": "revulsion",
        "meaning": "A sense of disgust and loathing.",
        "examples": [
          "She felt a deep revulsion at the sight of the cruelty.",
          "The gruesome crime filled him with revulsion."
        ]
      },
      {
        "id": "g51w30",
        "word": "rhapsody",
        "meaning": "An ecstatic expression of feeling or enthusiasm.",
        "examples": [
          "He launched into a rhapsody of praise for his favorite artist.",
          "The music was a vibrant rhapsody of classical and folk melodies."
        ]
      },
      {
        "id": "g51w31",
        "word": "rhetoric",
        "meaning": "The art of effective or persuasive speaking or writing, especially the use of figures of speech and other compositional techniques. Language designed to have a persuasive or impressive effect on its audience, but often regarded as lacking in sincerity or meaningful content.",
        "examples": [
          "The politician's rhetoric was designed to appeal to nationalist sentiments.",
          "He used strong rhetoric to win over the crowd."
        ]
      },
      {
        "id": "g51w32",
        "word": "rhetorical",
        "meaning": "Relating to or concerned with the art of rhetoric. Asked in order to produce an effect or to make a statement rather than to elicit information.",
        "examples": [
          "His speech was full of clever rhetorical devices.",
          "She asked a rhetorical question, not expecting an answer."
        ]
      },
      {
        "id": "g51w33",
        "word": "ribald",
        "meaning": "Referring to sexual matters in an amusingly rude or irreverent way.",
        "examples": [
          "The comedian's ribald jokes offended some audience members.",
          "He enjoyed telling ribald stories to his close friends."
        ]
      },
      {
        "id": "g51w34",
        "word": "rickety",
        "meaning": "(Of a structure or piece of furniture) poorly made and likely to collapse.",
        "examples": [
          "They crossed the rickety bridge with caution.",
          "The old chair was so rickety it looked like it would fall apart."
        ]
      },
      {
        "id": "g51w35",
        "word": "ridden",
        "meaning": "Dominated or burdened by.",
        "examples": [
          "The community was crime-ridden, making it unsafe.",
          "The essay was concept-ridden, making it difficult to understand."
        ]
      },
      {
        "id": "g51w36",
        "word": "rife",
        "meaning": "(Especially of something undesirable or harmful) of common occurrence; widespread.",
        "examples": [
          "The city was rife with rumors about the scandal.",
          "Diseases were rife in the overcrowded refugee camp."
        ]
      },
      {
        "id": "g51w37",
        "word": "rift",
        "meaning": "A crack, split, or break in something. A serious break in friendly relations between two groups or people.",
        "examples": [
          "A deep rift appeared in the glacier.",
          "The disagreement created a rift between the two former allies."
        ]
      },
      {
        "id": "g51w38",
        "word": "rigor",
        "meaning": "The quality of being extremely thorough, exhaustive, or accurate. Severity or strictness.",
        "examples": [
          "The research was conducted with scientific rigor.",
          "He trained with extreme rigor to prepare for the marathon."
        ]
      },
      {
        "id": "g51w39",
        "word": "rile",
        "meaning": "To make (someone) annoyed or irritated.",
        "examples": [
          "His constant teasing began to rile her.",
          "The unfair decision riled the protesters."
        ]
      },
      {
        "id": "g51w40",
        "word": "riposte",
        "meaning": "A quick, clever reply to an insult or criticism.",
        "examples": [
          "She delivered a sharp riposte to his sarcastic remark.",
          "His witty riposte earned a laugh from the audience."
        ]
      },
      {
        "id": "g51w41",
        "word": "risible",
        "meaning": "Provoking laughter through being ludicrous or absurd.",
        "examples": [
          "His excuses for being late were utterly risible.",
          "The plot of the movie was so bad it was risible."
        ]
      },
      {
        "id": "g51w42",
        "word": "risque",
        "meaning": "Slightly indecent or suggestive; bordering on impropriety.",
        "examples": [
          "The comedian's risque jokes made some people uncomfortable.",
          "She preferred art that wasn't too risque for public display."
        ]
      },
      {
        "id": "g51w43",
        "word": "robust",
        "meaning": "Strong and healthy; vigorous. (Of an object) sturdy in construction. (Of a system, organization, or plan) able to withstand adverse conditions or scrutiny.",
        "examples": [
          "The company has a robust financial standing.",
          "He enjoys a robust red wine with his dinner."
        ]
      },
      {
        "id": "g51w44",
        "word": "rococo",
        "meaning": "Of or characterized by an elaborately ornamental late baroque style of decoration prevalent in 18th-century Continental Europe, with asymmetrical patterns involving scrolls, curves, and foliage.",
        "examples": [
          "The palace was decorated in a flamboyant rococo style.",
          "Her taste in furniture leaned towards the elaborate rococo period."
        ]
      },
      {
        "id": "g51w45",
        "word": "romp",
        "meaning": "To play roughly and energetically. An easy victory.",
        "examples": [
          "The children romped in the park all afternoon.",
          "The team had an easy romp to victory in the championship game."
        ]
      },
      {
        "id": "g51w46",
        "word": "roster",
        "meaning": "A list or plan showing turns of duty or leave for individuals or groups in an organization. A list of members of a team or organization.",
        "examples": [
          "The coach announced the final roster for the basketball team.",
          "Check the staff roster to see who is working tonight."
        ]
      },
      {
        "id": "g51w47",
        "word": "rotund",
        "meaning": "(Of a person) plump; corpulent. (Of speech or literary style) round or full in sound or phraseology; grandiloquent.",
        "examples": [
          "The rotund man chuckled heartily.",
          "He delivered a rotund speech, full of elaborate metaphors."
        ]
      },
      {
        "id": "g51w48",
        "word": "row",
        "meaning": "A noisy quarrel or dispute. A line of people or things placed side by side.",
        "examples": [
          "The neighbors had a loud row about the fence.",
          "They sat in the front row of the theater."
        ]
      },
      {
        "id": "g51w49",
        "word": "rubric",
        "meaning": "A heading on a document. A set of instructions or rules, especially in an examination or religious service. A guide or scoring guide for an assessment.",
        "examples": [
          "The essay was graded according to a detailed rubric.",
          "Under the rubric of 'general conduct,' students were expected to be respectful."
        ]
      },
      {
        "id": "g51w50",
        "word": "rudimentary",
        "meaning": "Involving or limited to basic principles. Of or relating to an undeveloped or primitive form.",
        "examples": [
          "He had only a rudimentary understanding of physics.",
          "The early settlements had only rudimentary sanitation systems."
        ]
      },
      {
        "id": "g51w51",
        "word": "rue",
        "meaning": "To bitterly regret (something that one has done or allowed to happen).",
        "examples": [
          "She will rue the day she crossed him.",
          "He came to rue his hasty decision to sell the house."
        ]
      },
      {
        "id": "g51w52",
        "word": "ruffian",
        "meaning": "A violent, lawless person, especially a gang member.",
        "examples": [
          "The street was known for its notorious ruffians.",
          "She was accosted by a group of ruffians in the alley."
        ]
      },
      {
        "id": "g51w53",
        "word": "ruminate",
        "meaning": "To think deeply about something; contemplate. (Of a ruminant animal) to chew the cud.",
        "examples": [
          "He spent hours ruminating on the meaning of life.",
          "The cow continued to ruminate in the pasture."
        ]
      },
      {
        "id": "g51w54",
        "word": "runic",
        "meaning": "Of or relating to runes or similar ancient characters. Mysterious or obscure.",
        "examples": [
          "The ancient inscription was written in runic symbols.",
          "The old wizard spoke in a series of runic incantations."
        ]
      },
      {
        "id": "g51w55",
        "word": "ruse",
        "meaning": "An action intended to deceive someone; a trick.",
        "examples": [
          "It was a clever ruse to get past the guards.",
          "The magician's vanishing act was nothing more than a ruse."
        ]
      },
      {
        "id": "g51w56",
        "word": "rustic",
        "meaning": "Of or relating to the countryside; rural. Lacking sophistication or elegance.",
        "examples": [
          "They enjoyed the rustic charm of the old cottage.",
          "The food was simple but had a rustic, homemade quality."
        ]
      },
      {
        "id": "g51w57",
        "word": "saccharine",
        "meaning": "Excessively sweet or sentimental.",
        "examples": [
          "Her saccharine smile masked her true feelings.",
          "The movie was criticized for its saccharine portrayal of romance."
        ]
      },
      {
        "id": "g51w58",
        "word": "sacrosanct",
        "meaning": "(Especially of a principle, place, or routine) regarded as too important or valuable to be interfered with.",
        "examples": [
          "The right to vote is a sacrosanct principle in a democracy.",
          "His morning coffee ritual was sacrosanct."
        ]
      },
      {
        "id": "g51w59",
        "word": "sadistic",
        "meaning": "Deriving pleasure from inflicting pain, suffering, or humiliation on others.",
        "examples": [
          "The villain in the story exhibited sadistic tendencies.",
          "His sadistic teasing often made the other children cry."
        ]
      },
      {
        "id": "g51w60",
        "word": "saga",
        "meaning": "A long story of heroic achievement, especially a medieval Icelandic or Norse one. A long, involved story, account, or series of incidents.",
        "examples": [
          "The family saga spanned several generations and continents.",
          "His journey from poverty to wealth was a remarkable saga."
        ]
      }
    ]
  }