{
    "id": "group40",
    "words": [
      {
        "id": "g40w1",
        "word": "oblique",
        "meaning": "Not explicit or direct in addressing a point; slanting.",
        "examples": [
          "He made an oblique reference to his rival's past failures.",
          "The lines in the painting were oblique, creating a sense of dynamic movement."
        ]
      },
      {
        "id": "g40w2",
        "word": "obliquity",
        "meaning": "Deviation from moral rectitude or sound thinking; indirectness or deliberate obscurity.",
        "examples": [
          "The politician's speech was full of obliquity and half-truths.",
          "His moral obliquity was evident in his dishonest business dealings."
        ]
      },
      {
        "id": "g40w3",
        "word": "obliterate",
        "meaning": "To destroy utterly; wipe out.",
        "examples": [
          "The bombing raid threatened to obliterate the entire city.",
          "She wanted to obliterate all memory of her painful past."
        ]
      },
      {
        "id": "g40w4",
        "word": "oblivion",
        "meaning": "The state of being unaware or unconscious of what is happening; the state of being forgotten.",
        "examples": [
          "The once-famous actor has now faded into oblivion.",
          "He drank himself into oblivion after hearing the bad news."
        ]
      },
      {
        "id": "g40w5",
        "word": "oblivious",
        "meaning": "Not aware of or not concerned about what is happening around one.",
        "examples": [
          "Deep in his book, he was completely oblivious to the noise around him.",
          "She seemed oblivious to the fact that she had offended everyone."
        ]
      },
      {
        "id": "g40w6",
        "word": "obloquy",
        "meaning": "Strong public criticism or verbal abuse.",
        "examples": [
          "The disgraced CEO faced a storm of public obloquy after the scandal broke.",
          "He endured years of obloquy from his political opponents."
        ]
      },
      {
        "id": "g40w7",
        "word": "obnoxious",
        "meaning": "Extremely unpleasant; highly offensive.",
        "examples": [
          "His obnoxious behavior at the dinner party made everyone uncomfortable.",
          "There was an obnoxious smell coming from the garbage can."
        ]
      },
      {
        "id": "g40w8",
        "word": "obscure",
        "meaning": "Not discovered or known about; uncertain. Also, to keep from being seen; to conceal.",
        "examples": [
          "He was an obscure writer whose work was only appreciated after his death.",
          "The heavy fog threatened to obscure the road ahead."
        ]
      },
      {
        "id": "g40w9",
        "word": "obsequious",
        "meaning": "Obedient or attentive to an excessive or servile degree.",
        "examples": [
          "The obsequious assistant was always trying to flatter his boss.",
          "She had no patience for obsequious salespeople."
        ]
      },
      {
        "id": "g40w10",
        "word": "obsess",
        "meaning": "To preoccupy or fill the mind of (someone) continually and intrusively.",
        "examples": [
          "He started to obsess about his weight and diet.",
          "Don't obsess over small mistakes; just learn from them."
        ]
      },
      {
        "id": "g40w11",
        "word": "obsession",
        "meaning": "An idea or thought that continually preoccupies or intrudes on a person's mind.",
        "examples": [
          "His obsession with collecting stamps took up all his free time.",
          "She developed an unhealthy obsession with her favorite celebrity."
        ]
      },
      {
        "id": "g40w12",
        "word": "obsidian",
        "meaning": "A hard, dark, glasslike volcanic rock formed by the rapid solidification of lava.",
        "examples": [
          "Ancient peoples used obsidian to make sharp tools and arrowheads.",
          "The sculpture was carved from a single piece of polished black obsidian."
        ]
      },
      {
        "id": "g40w13",
        "word": "obsolescence",
        "meaning": "The process of becoming outdated and no longer used.",
        "examples": [
          "Planned obsolescence in electronics encourages consumers to buy new models frequently.",
          "The rapid pace of technology leads to the quick obsolescence of older devices."
        ]
      },
      {
        "id": "g40w14",
        "word": "obsolete",
        "meaning": "No longer produced or used; out of date.",
        "examples": [
          "The use of floppy disks is now completely obsolete.",
          "The company had to replace its obsolete manufacturing equipment."
        ]
      },
      {
        "id": "g40w15",
        "word": "obstetrician",
        "meaning": "A doctor who specializes in pregnancy, childbirth, and the postpartum period.",
        "examples": [
          "She chose an obstetrician who worked at the nearby hospital.",
          "The obstetrician monitored the health of the mother and baby throughout the pregnancy."
        ]
      },
      {
        "id": "g40w16",
        "word": "obstinate",
        "meaning": "Stubbornly refusing to change one's opinion or chosen course of action.",
        "examples": [
          "He was obstinate and refused to admit he was wrong, despite all the evidence.",
          "The obstinate mule would not move an inch."
        ]
      },
      {
        "id": "g40w17",
        "word": "obstreperous",
        "meaning": "Noisy and difficult to control.",
        "examples": [
          "The obstreperous children were running and shouting in the restaurant.",
          "The teacher struggled to manage the obstreperous class."
        ]
      },
      {
        "id": "g40w18",
        "word": "obstructionist",
        "meaning": "A person who deliberately blocks or gets in the way of progress.",
        "examples": [
          "The senator was accused of being an obstructionist for filibustering the bill.",
          "Progress on the committee was stalled by a few determined obstructionists."
        ]
      },
      {
        "id": "g40w19",
        "word": "obtain",
        "meaning": "To get, acquire, or secure something.",
        "examples": [
          "You can obtain a copy of the report from the main office.",
          "He worked hard to obtain the necessary qualifications for the job."
        ]
      },
      {
        "id": "g40w20",
        "word": "obtrusive",
        "meaning": "Noticeable or prominent in an unwelcome or intrusive way.",
        "examples": [
          "The new skyscraper was an obtrusive addition to the historic city skyline.",
          "He had an obtrusive way of asking very personal questions."
        ]
      },
      {
        "id": "g40w21",
        "word": "obtuse",
        "meaning": "Annoyingly insensitive or slow to understand.",
        "examples": [
          "He was being deliberately obtuse, refusing to understand her point.",
          "I'm not sure if he's genuinely obtuse or just pretending not to get it."
        ]
      },
      {
        "id": "g40w22",
        "word": "obviate",
        "meaning": "To remove a need or difficulty; to avoid or prevent.",
        "examples": [
          "A direct flight would obviate the need for a layover.",
          "Careful planning should obviate any last-minute problems."
        ]
      },
      {
        "id": "g40w23",
        "word": "obvious",
        "meaning": "Easily perceived or understood; clear, self-evident, or apparent.",
        "examples": [
          "The answer to the riddle was obvious once he explained it.",
          "It was obvious from her expression that she was angry."
        ]
      },
      {
        "id": "g40w24",
        "word": "occlude",
        "meaning": "To stop, close up, or obstruct an opening or passage.",
        "examples": [
          "A buildup of plaque can occlude the arteries.",
          "The dense fog began to occlude the view of the mountains."
        ]
      },
      {
        "id": "g40w25",
        "word": "occluded",
        "meaning": "Stopped up; blocked or obstructed.",
        "examples": [
          "The patient required surgery for an occluded coronary artery.",
          "The path was occluded by a large, fallen tree."
        ]
      },
      {
        "id": "g40w26",
        "word": "occult",
        "meaning": "Relating to mystical, supernatural, or magical powers, practices, or phenomena.",
        "examples": [
          "He had a deep interest in the occult and ancient magic.",
          "The horror movie was filled with occult symbols and rituals."
        ]
      },
      {
        "id": "g40w27",
        "word": "octogenarian",
        "meaning": "A person who is from 80 to 89 years old.",
        "examples": [
          "My grandfather, an active octogenarian, still plays golf twice a week.",
          "The community center hosted a birthday party for the beloved octogenarian."
        ]
      },
      {
        "id": "g40w28",
        "word": "oculist",
        "meaning": "An old-fashioned term for an ophthalmologist or optometrist.",
        "examples": [
          "In the 19th century, you would visit an oculist for eye-related problems.",
          "The oculist prescribed a new pair of spectacles for him."
        ]
      },
      {
        "id": "g40w29",
        "word": "odious",
        "meaning": "Extremely unpleasant; repulsive.",
        "examples": [
          "The villain in the story was a truly odious character.",
          "She had the odious task of cleaning out the grease trap."
        ]
      },
      {
        "id": "g40w30",
        "word": "odium",
        "meaning": "General or widespread hatred or disgust directed toward someone as a result of their actions.",
        "examples": [
          "The dictator's cruelty earned him the odium of the entire world.",
          "After the scandal, he had to face the public odium."
        ]
      },
      {
        "id": "g40w31",
        "word": "odoriferous",
        "meaning": "Having or giving off a smell, especially an unpleasant one.",
        "examples": [
          "The odoriferous durian fruit is banned in many public places.",
          "A strange, odoriferous gas seeped from the chemical spill."
        ]
      },
      {
        "id": "g40w32",
        "word": "odorous",
        "meaning": "Having or giving off a smell.",
        "examples": [
          "The garden was filled with the scent of odorous flowers.",
          "The odorous swamp was home to many insects."
        ]
      },
      {
        "id": "g40w33",
        "word": "odyssey",
        "meaning": "A long and eventful or adventurous journey or experience.",
        "examples": [
          "His journey from a small village to becoming a CEO was a remarkable odyssey.",
          "The book recounts the author's spiritual odyssey through India."
        ]
      },
      {
        "id": "g40w34",
        "word": "of the first water",
        "meaning": "Of the best quality or the most extreme degree.",
        "examples": [
          "The jeweler confirmed that the diamond was of the first water.",
          "He was a scoundrel of the first water."
        ]
      },
      {
        "id": "g40w35",
        "word": "off the beaten track",
        "meaning": "In a place where few people go; remote and isolated.",
        "examples": [
          "They found a charming little cafe off the beaten track.",
          "As a tourist, he preferred to explore places that were off the beaten track."
        ]
      },
      {
        "id": "g40w36",
        "word": "offal",
        "meaning": "The entrails and internal organs of an animal used as food.",
        "examples": [
          "The traditional Scottish dish, haggis, is made from offal.",
          "Some cultures consider dishes made with offal a delicacy."
        ]
      },
      {
        "id": "g40w37",
        "word": "offertory",
        "meaning": "The part of a Christian service where offerings of money are collected.",
        "examples": [
          "The choir sang a beautiful anthem during the offertory.",
          "The money collected in the offertory supports the church's community programs."
        ]
      },
      {
        "id": "g40w38",
        "word": "offhand",
        "meaning": "Casually or coolly unconcerned; without previous thought.",
        "examples": [
          "His offhand comment about her appearance was hurtful.",
          "I can't tell you the exact numbers offhand, but I can find out."
        ]
      },
      {
        "id": "g40w39",
        "word": "officious",
        "meaning": "Assertive of authority in an annoyingly domineering way, especially with regard to trivial matters.",
        "examples": [
          "The officious security guard enjoyed telling people what to do.",
          "She was an officious busybody, always interfering in her neighbors' lives."
        ]
      },
      {
        "id": "g40w40",
        "word": "offset",
        "meaning": "To counteract something by having an opposing force or effect.",
        "examples": [
          "The pay raise was intended to offset the increase in the cost of living.",
          "He planted trees to offset his carbon emissions from flying."
        ]
      },
      {
        "id": "g40w41",
        "word": "ogle",
        "meaning": "To stare at in a lecherous or flirtatious manner.",
        "examples": [
          "It's rude to ogle people at the beach.",
          "The creepy man in the corner continued to ogle the young women."
        ]
      },
      {
        "id": "g40w42",
        "word": "olfactory",
        "meaning": "Relating to the sense of smell.",
        "examples": [
          "A dog's olfactory sense is far more powerful than a human's.",
          "The smell of baking bread triggered a pleasant olfactory memory."
        ]
      },
      {
        "id": "g40w43",
        "word": "oligarchy",
        "meaning": "A small group of people having control of a country or organization.",
        "examples": [
          "The nation was ruled by a corrupt oligarchy of wealthy elites.",
          "He argued that the company was an oligarchy run by a few powerful executives."
        ]
      },
      {
        "id": "g40w44",
        "word": "ominous",
        "meaning": "Giving the impression that something bad or unpleasant is going to happen; threatening.",
        "examples": [
          "The ominous black clouds on the horizon signaled a coming storm.",
          "There was an ominous silence after he made his threat."
        ]
      },
      {
        "id": "g40w45",
        "word": "omission",
        "meaning": "Someone or something that has been left out or excluded.",
        "examples": [
          "The most notable omission from the guest list was the bride's own brother.",
          "Her story was suspicious due to several key omissions."
        ]
      },
      {
        "id": "g40w46",
        "word": "omnipotent",
        "meaning": "Having unlimited power; able to do anything.",
        "examples": [
          "In many mythologies, the chief deity is portrayed as omnipotent.",
          "The tyrannical ruler believed he was omnipotent and beyond challenge."
        ]
      },
      {
        "id": "g40w47",
        "word": "omnipresent",
        "meaning": "Present everywhere at the same time.",
        "examples": [
          "In the modern world, the influence of social media feels omnipresent.",
          "For the paranoid man, the feeling of being watched was omnipresent."
        ]
      },
      {
        "id": "g40w48",
        "word": "omniscience",
        "meaning": "The state of knowing everything.",
        "examples": [
          "The belief in divine omniscience is a key tenet of many religions.",
          "No human being can ever achieve true omniscience."
        ]
      },
      {
        "id": "g40w49",
        "word": "omniscient",
        "meaning": "Knowing everything.",
        "examples": [
          "The novel is told from the point of view of an omniscient narrator.",
          "If I were omniscient, I'd know the answers to all of life's mysteries."
        ]
      },
      {
        "id": "g40w50",
        "word": "omnivorous",
        "meaning": "Feeding on food of both plant and animal origin; having a varied diet.",
        "examples": [
          "Humans are omnivorous, though many choose a vegetarian or vegan diet.",
          "She has an omnivorous taste in music, enjoying everything from classical to heavy metal."
        ]
      },
      {
        "id": "g40w51",
        "word": "on pins and needles",
        "meaning": "In an anxious or nervous state of suspense.",
        "examples": [
          "The entire team was on pins and needles waiting for the final results.",
          "She was on pins and needles until she heard that her family was safe."
        ]
      },
      {
        "id": "g40w52",
        "word": "on tenter hooks",
        "meaning": "In a state of suspense or anxiety.",
        "examples": [
          "He was on tenter hooks all day, waiting for news about the job offer.",
          "The thrilling movie kept the audience on tenter hooks until the very end."
        ]
      },
      {
        "id": "g40w53",
        "word": "on the bandwagon",
        "meaning": "Joining others in doing or supporting something that is popular or likely to be successful.",
        "examples": [
          "After the team won the championship, thousands of new fans jumped on the bandwagon.",
          "Many politicians are quick to jump on the bandwagon of a popular social cause."
        ]
      },
      {
        "id": "g40w54",
        "word": "on the carpet",
        "meaning": "Being reprimanded by someone in authority.",
        "examples": [
          "He was called on the carpet for missing another important deadline.",
          "The players were on the carpet with the coach for their poor performance."
        ]
      },
      {
        "id": "g40w55",
        "word": "on the dot",
        "meaning": "Exactly at the arranged time.",
        "examples": [
          "The meeting is scheduled for 9 AM, so please be here on the dot.",
          "He is very punctual and always arrives on the dot."
        ]
      },
      {
        "id": "g40w56",
        "word": "on the qui vive",
        "meaning": "On the alert; vigilant.",
        "examples": [
          "The security guards were on the qui vive for any signs of trouble.",
          "As a journalist, you always have to be on the qui vive for a good story."
        ]
      },
      {
        "id": "g40w57",
        "word": "on the spur of the moment",
        "meaning": "Done as a result of a sudden impulse, without premeditation.",
        "examples": [
          "They decided to fly to Paris on the spur of the moment.",
          "On the spur of the moment, he quit his job and bought a boat."
        ]
      },
      {
        "id": "g40w58",
        "word": "once in a blue moon",
        "meaning": "Very rarely.",
        "examples": [
          "An opportunity like this comes along only once in a blue moon.",
          "I only get to see my cousins from Australia once in a blue moon."
        ]
      },
      {
        "id": "g40w59",
        "word": "one swallow doesn't make a summer",
        "meaning": "A single positive event is not a reliable indicator of a general trend.",
        "examples": [
          "The company's stock went up today, but one swallow doesn't make a summer.",
          "He was nice to me once, but I know that one swallow doesn't make a summer."
        ]
      },
      {
        "id": "g40w60",
        "word": "onerous",
        "meaning": "(Of a task or duty) involving an amount of effort and difficulty that is oppressively burdensome.",
        "examples": [
          "He found the responsibility of caring for his elderly parents to be an onerous task.",
          "The paperwork for the visa application was long and onerous."
        ]
      }
    ]
  }