{
    "id": "group36",
    "words": [
      {
        "id": "g36w1",
        "word": "lugubrious",
        "meaning": "Looking or sounding sad and dismal.",
        "examples": [
          "The weeping willow has a particularly lugubrious appearance.",
          "He played a lugubrious tune on the cello that matched his somber mood."
        ]
      },
      {
        "id": "g36w2",
        "word": "lull",
        "meaning": "A temporary interval of quiet or lack of activity; to calm or send to sleep.",
        "examples": [
          "There was a brief lull in the storm before the wind picked up again.",
          "The gentle music and soft lighting helped to lull the baby to sleep."
        ]
      },
      {
        "id": "g36w3",
        "word": "lumber",
        "meaning": "To move in a slow, heavy, awkward way.",
        "examples": [
          "The old bear lumbered through the forest in search of berries.",
          "The heavy furniture had to be lumbered up three flights of stairs."
        ]
      },
      {
        "id": "g36w4",
        "word": "luminary",
        "meaning": "A person who inspires or influences others, especially one prominent in a particular sphere.",
        "examples": [
          "The conference attracted many luminaries from the world of technology.",
          "She was considered a luminary in the field of modern art."
        ]
      },
      {
        "id": "g36w5",
        "word": "luminous",
        "meaning": "Emitting or reflecting bright light; shining.",
        "examples": [
          "The fireflies created a luminous display in the dark forest.",
          "She wore a dress of luminous silk that seemed to glow."
        ]
      },
      {
        "id": "g36w6",
        "word": "lurid",
        "meaning": "Presented in vividly shocking or sensational terms; (of a color) unpleasantly bright or harsh.",
        "examples": [
          "The tabloid newspaper was famous for its lurid headlines and scandalous stories.",
          "He had a lurid nightmare about being chased by monsters."
        ]
      },
      {
        "id": "g36w7",
        "word": "lush",
        "meaning": "(Of vegetation) growing luxuriantly; rich, elaborate, and luxurious.",
        "examples": [
          "After the rains, the countryside was lush and green.",
          "They stayed in a lush hotel suite with a private balcony."
        ]
      },
      {
        "id": "g36w8",
        "word": "lustrous",
        "meaning": "Having a soft glow or sheen; shining.",
        "examples": [
          "The antique table had a deep, lustrous finish.",
          "She was admired for her lustrous, healthy hair."
        ]
      },
      {
        "id": "g36w9",
        "word": "macabre",
        "meaning": "Disturbing and horrifying because of involvement with or depiction of death and injury.",
        "examples": [
          "The film was a macabre tale of ghosts and haunted houses.",
          "He had a macabre sense of humor that sometimes made others uncomfortable."
        ]
      },
      {
        "id": "g36w10",
        "word": "mace",
        "meaning": "A heavy, spiked club used as a weapon in the past; a ceremonial staff of office.",
        "examples": [
          "The medieval knight carried a shield and a heavy mace.",
          "The university's president carried the ceremonial mace during the graduation procession."
        ]
      },
      {
        "id": "g36w11",
        "word": "macerate",
        "meaning": "To soften or break up (something, especially food) by soaking in a liquid.",
        "examples": [
          "The recipe requires you to macerate the strawberries in sugar for an hour.",
          "The chemists had to macerate the plant material to extract the compounds."
        ]
      },
      {
        "id": "g36w12",
        "word": "Machiavellian",
        "meaning": "Cunning, scheming, and unscrupulous, especially in politics or in advancing one's career.",
        "examples": [
          "His Machiavellian tactics helped him climb the corporate ladder, but they also earned him many enemies.",
          "The TV show is full of Machiavellian characters plotting against one another."
        ]
      },
      {
        "id": "g36w13",
        "word": "machiavellian",
        "meaning": "Cunning, scheming, and unscrupulous.",
        "examples": [
          "It was a machiavellian scheme to seize control of the company.",
          "Her machiavellian intelligence was both admired and feared."
        ]
      },
      {
        "id": "g36w14",
        "word": "machination",
        "meaning": "A plot or scheme, usually a crafty and involved one.",
        "examples": [
          "The political thriller was full of complex machinations and betrayals.",
          "He was a victim of his rival's clever machinations."
        ]
      },
      {
        "id": "g36w15",
        "word": "maelstrom",
        "meaning": "A powerful whirlpool; a situation or state of confused movement or violent turmoil.",
        "examples": [
          "The ship was caught in a terrifying maelstrom and sank.",
          "After the CEO resigned, the company was thrown into a maelstrom of uncertainty."
        ]
      },
      {
        "id": "g36w16",
        "word": "magisterial",
        "meaning": "Having or showing great authority.",
        "examples": [
          "He delivered his speech in a magisterial tone, leaving no room for argument.",
          "The biography is a magisterial work of scholarship."
        ]
      },
      {
        "id": "g36w17",
        "word": "magnanimity",
        "meaning": "The quality of being very generous or forgiving.",
        "examples": [
          "The winner showed great magnanimity by praising his defeated opponent.",
          "She accepted the apology with magnanimity and grace."
        ]
      },
      {
        "id": "g36w18",
        "word": "magnanimous",
        "meaning": "Generous or forgiving, especially toward a rival or someone less powerful than oneself.",
        "examples": [
          "It was magnanimous of him to forgive the man who had wronged him.",
          "She made a magnanimous gesture by donating the prize money to charity."
        ]
      },
      {
        "id": "g36w19",
        "word": "magnate",
        "meaning": "A wealthy and influential person, especially in business.",
        "examples": [
          "The oil magnate owned several refineries and a fleet of tankers.",
          "The tech magnate is known for his philanthropy and innovative ideas."
        ]
      },
      {
        "id": "g36w20",
        "word": "maim",
        "meaning": "To wound or injure (someone) so that part of the body is permanently damaged.",
        "examples": [
          "The industrial accident threatened to maim the worker for life.",
          "Landmines can kill or maim innocent civilians years after a conflict has ended."
        ]
      },
      {
        "id": "g36w21",
        "word": "maintain",
        "meaning": "To cause or enable a condition to continue; to provide for; to assert something as true.",
        "examples": [
          "He works two jobs to maintain his family.",
          "Throughout the trial, he continued to maintain his innocence."
        ]
      },
      {
        "id": "g36w22",
        "word": "make bricks without straw",
        "meaning": "To attempt to do something without having the necessary materials or resources.",
        "examples": [
          "Expecting me to finish this report without the data is like asking me to make bricks without straw.",
          "They want us to launch a new product with no marketing budget, but you can't make bricks without straw."
        ]
      },
      {
        "id": "g36w23",
        "word": "makeshift",
        "meaning": "Serving as a temporary and often improvised substitute.",
        "examples": [
          "The survivors built a makeshift shelter from the wreckage of the plane.",
          "We used a cardboard box as a makeshift table for our picnic."
        ]
      },
      {
        "id": "g36w24",
        "word": "maladjusted",
        "meaning": "Failing or unable to cope with the demands of a normal social environment.",
        "examples": [
          "The school had a special program for socially maladjusted children.",
          "His maladjusted behavior made it difficult for him to keep a job."
        ]
      },
      {
        "id": "g36w25",
        "word": "maladroit",
        "meaning": "Ineffective or clumsy.",
        "examples": [
          "His maladroit attempt to fix the sink only made the leak worse.",
          "Her maladroit comments during the interview cost her the job."
        ]
      },
      {
        "id": "g36w26",
        "word": "malady",
        "meaning": "A disease or ailment.",
        "examples": [
          "The doctor struggled to diagnose the mysterious malady affecting the patient.",
          "Apathy is a social malady that can cripple a community's progress."
        ]
      },
      {
        "id": "g36w27",
        "word": "malapropism",
        "meaning": "The mistaken use of a word in place of a similar-sounding one, often with an amusing effect.",
        "examples": [
          "He created a malapropism by saying 'illiterate' when he meant 'obliterate.'",
          "Her speech was full of unintentional malapropisms that made the audience chuckle."
        ]
      },
      {
        "id": "g36w28",
        "word": "malediction",
        "meaning": "A magical word or phrase uttered with the intention of bringing about evil; a curse.",
        "examples": [
          "In the fairy tale, the witch utters a malediction upon the princess.",
          "He muttered a malediction under his breath at the driver who cut him off."
        ]
      },
      {
        "id": "g36w29",
        "word": "malevolent",
        "meaning": "Having or showing a wish to do evil to others.",
        "examples": [
          "The villain in the story had a malevolent glare.",
          "She could feel a malevolent presence in the abandoned house."
        ]
      },
      {
        "id": "g36w30",
        "word": "malfeasance",
        "meaning": "Wrongdoing, especially by a public official.",
        "examples": [
          "The mayor was removed from office for gross malfeasance.",
          "The investigation uncovered years of corporate malfeasance."
        ]
      },
      {
        "id": "g36w31",
        "word": "malice",
        "meaning": "The intention or desire to do evil; ill will.",
        "examples": [
          "The false rumors were spread with pure malice.",
          "I can assure you I bear you no malice."
        ]
      },
      {
        "id": "g36w32",
        "word": "malign",
        "meaning": "To speak about (someone) in a spitefully critical manner; evil in nature or effect.",
        "examples": [
          "She was hurt that her former friend would malign her in public.",
          "The biopsy results thankfully showed that the tumor was not malign."
        ]
      },
      {
        "id": "g36w33",
        "word": "malignant",
        "meaning": "(Of a disease) very virulent or infectious; malevolent.",
        "examples": [
          "The doctor gave him the grim news that the tumor was malignant.",
          "He was a malignant influence on the entire team, spreading gossip and discontent."
        ]
      },
      {
        "id": "g36w34",
        "word": "malingerer",
        "meaning": "A person who pretends to be ill in order to escape duty or work.",
        "examples": [
          "The army sergeant had a knack for spotting a malingerer.",
          "Her boss suspected she was a malingerer when she called in sick every Friday."
        ]
      },
      {
        "id": "g36w35",
        "word": "malleable",
        "meaning": "Able to be hammered or pressed into shape without breaking; easily influenced.",
        "examples": [
          "Gold is a malleable metal, which is why it's popular for jewelry.",
          "The minds of young children are malleable and open to new ideas."
        ]
      },
      {
        "id": "g36w36",
        "word": "malnutrition",
        "meaning": "Lack of proper nutrition, caused by not having enough to eat, not eating enough of the right things, or being unable to use the food one eats.",
        "examples": [
          "The aid workers treated many children suffering from severe malnutrition.",
          "A poor diet is a leading cause of malnutrition."
        ]
      },
      {
        "id": "g36w37",
        "word": "malodorous",
        "meaning": "Smelling very unpleasant.",
        "examples": [
          "The malodorous garbage had been sitting in the sun for days.",
          "He had to clean the malodorous kennel."
        ]
      },
      {
        "id": "g36w38",
        "word": "mammoth",
        "meaning": "Huge; enormous.",
        "examples": [
          "The company undertook the mammoth task of digitizing all its records.",
          "Building the transcontinental railroad was a mammoth project."
        ]
      },
      {
        "id": "g36w39",
        "word": "manacle",
        "meaning": "A metal band, chain, or shackle for fastening someone's hands or ankles.",
        "examples": [
          "The prisoner's hands were bound in manacles.",
          "He felt trapped by the manacles of poverty."
        ]
      },
      {
        "id": "g36w40",
        "word": "mandate",
        "meaning": "An official order or commission to do something; the authority to carry out a policy.",
        "examples": [
          "The government was elected with a clear mandate to reform healthcare.",
          "The court issued a mandate to stop construction on the site."
        ]
      },
      {
        "id": "g36w41",
        "word": "manifest",
        "meaning": "Clear or obvious to the eye or mind; to display or show a quality or feeling.",
        "examples": [
          "Her relief was manifest in her happy expression.",
          "Stress can manifest itself in many ways, including headaches and insomnia."
        ]
      },
      {
        "id": "g36w42",
        "word": "manifold",
        "meaning": "Many and various.",
        "examples": [
          "The reasons for her success are manifold.",
          "As a manager, he had manifold responsibilities."
        ]
      },
      {
        "id": "g36w43",
        "word": "mannered",
        "meaning": "Artificial or stilted in behavior or style.",
        "examples": [
          "His speech was so mannered and rehearsed that it didn't feel sincere.",
          "The acting in the period drama was criticized for being too mannered."
        ]
      },
      {
        "id": "g36w44",
        "word": "mar",
        "meaning": "To impair the appearance of; to disfigure or spoil.",
        "examples": [
          "A single scratch can mar the finish of a new car.",
          "The beauty of the landscape was marred by the construction of a large factory."
        ]
      },
      {
        "id": "g36w45",
        "word": "marginal",
        "meaning": "Relating to or at the edge or margin; of secondary or minor importance.",
        "examples": [
          "The change in the new software version was only marginal.",
          "The government program was designed to help people in marginal communities."
        ]
      },
      {
        "id": "g36w46",
        "word": "marginalize",
        "meaning": "To treat (a person, group, or concept) as insignificant or peripheral.",
        "examples": [
          "The new economic policies tended to marginalize the poorest members of society.",
          "It is important to amplify the voices of those who have been marginalized."
        ]
      },
      {
        "id": "g36w47",
        "word": "marshal",
        "meaning": "To arrange or assemble (a group of people, especially soldiers) in order.",
        "examples": [
          "The general began to marshal his troops for the attack.",
          "She tried to marshal her thoughts before giving the important presentation."
        ]
      },
      {
        "id": "g36w48",
        "word": "martial",
        "meaning": "Relating to fighting or war.",
        "examples": [
          "The country was put under martial law during the rebellion.",
          "He was a student of the martial arts."
        ]
      },
      {
        "id": "g39w49",
        "word": "martinet",
        "meaning": "A strict disciplinarian, especially in the armed forces.",
        "examples": [
          "The drill sergeant was a notorious martinet who demanded perfection.",
          "Her boss was a martinet who insisted that all reports be submitted by 9 AM sharp."
        ]
      },
      {
        "id": "g36w50",
        "word": "masticate",
        "meaning": "To chew (food).",
        "examples": [
          "It is important to masticate your food thoroughly to aid digestion.",
          "The cow stood in the field, slowly masticating its cud."
        ]
      },
      {
        "id": "g36w51",
        "word": "mastiff",
        "meaning": "A dog of a large, strong breed with drooping ears and lips.",
        "examples": [
          "The huge mastiff looked intimidating, but it was actually very gentle.",
          "A loyal mastiff guarded the property."
        ]
      },
      {
        "id": "g36w52",
        "word": "materialism",
        "meaning": "A tendency to consider material possessions and physical comfort as more important than spiritual values.",
        "examples": [
          "Critics argue that modern society is plagued by consumerism and materialism.",
          "He rejected materialism and chose a life of simplicity."
        ]
      },
      {
        "id": "g36w53",
        "word": "matriarch",
        "meaning": "A woman who is the head of a family or tribe.",
        "examples": [
          "The family's matriarch, a formidable woman in her nineties, made all the important decisions.",
          "Elephant herds are led by an experienced matriarch."
        ]
      },
      {
        "id": "g36w54",
        "word": "matron",
        "meaning": "A woman in charge of domestic and medical arrangements at a boarding school or other institution; a dignified married woman.",
        "examples": [
          "The school matron took care of any students who felt unwell.",
          "The matron of the family hosted the annual holiday dinner."
        ]
      },
      {
        "id": "g36w55",
        "word": "maudlin",
        "meaning": "Self-pityingly or tearfully sentimental, often through drunkenness.",
        "examples": [
          "The movie's ending was so maudlin that half the audience was in tears.",
          "He became maudlin after a few beers and started talking about his ex-girlfriend."
        ]
      },
      {
        "id": "g36w56",
        "word": "maverick",
        "meaning": "An unorthodox or independent-minded person.",
        "examples": [
          "He was a maverick in his field, always challenging traditional methods.",
          "The politician was a maverick who often voted against his own party."
        ]
      },
      {
        "id": "g36w57",
        "word": "mawkish",
        "meaning": "Sentimental in a feeble or sickly way.",
        "examples": [
          "The greeting card was filled with mawkish poetry that made her cringe.",
          "He found the film's romantic scenes to be mawkish and unconvincing."
        ]
      }
    ]
  }