{
    "id": "group48",
    "words": [
      {
        "id": "g48w1",
        "word": "pursuant",
        "meaning": "In accordance with (a law or a legal document or resolution).",
        "examples": [
          "The company took action pursuant to the new regulations.",
          "Pursuant to our agreement, the payment is due on the first of the month."
        ]
      },
      {
        "id": "g48w2",
        "word": "pusillanimous",
        "meaning": "Showing a lack of courage or determination; timid.",
        "examples": [
          "The pusillanimous soldier was afraid to go into battle.",
          "His pusillanimous response to the challenge was disappointing."
        ]
      },
      {
        "id": "g48w3",
        "word": "put the cart before the horse",
        "meaning": "To do things in the wrong order.",
        "examples": [
          "Planning the wedding reception before proposing is putting the cart before the horse.",
          "Buying a car before you have a driver's license is like putting the cart before the horse."
        ]
      },
      {
        "id": "g48w4",
        "word": "putrefy",
        "meaning": "(of a body or other organic matter) decay or rot and produce a fetid smell.",
        "examples": [
          "The abandoned food began to putrefy in the heat.",
          "Without proper preservation, the carcass will quickly putrefy."
        ]
      },
      {
        "id": "g48w5",
        "word": "putrid",
        "meaning": "Decaying or rotting and emitting a fetid smell.",
        "examples": [
          "The putrid smell of garbage filled the alley.",
          "He discovered a putrid carcass in the woods."
        ]
      },
      {
        "id": "g48w6",
        "word": "pyrrhic",
        "meaning": "Won at too great a cost to have been worthwhile for the victor.",
        "examples": [
          "He won the lawsuit, but it was a Pyrrhic victory as his legal fees were enormous.",
          "The battle was a Pyrrhic one, with devastating losses on both sides."
        ]
      },
      {
        "id": "g48w7",
        "word": "Pyrrhic victory",
        "meaning": "A victory that inflicts such a devastating toll on the victor that it is tantamount to defeat.",
        "examples": [
          "The company's hostile takeover was a Pyrrhic victory, as it left them financially ruined.",
          "She won the argument but lost her friend, a true Pyrrhic victory."
        ]
      },
      {
        "id": "g48w8",
        "word": "quack",
        "meaning": "A person who dishonestly claims to have special knowledge and skill in some field, typically in medicine.",
        "examples": [
          "The so-called 'doctor' was exposed as a quack.",
          "Don't waste your money on that quack remedy."
        ]
      },
      {
        "id": "g48w9",
        "word": "quaff",
        "meaning": "To drink (something, especially an alcoholic drink) heartily.",
        "examples": [
          "The thirsty travelers were eager to quaff the cool water.",
          "He would quaff a whole pint of ale in one go."
        ]
      },
      {
        "id": "g48w10",
        "word": "quagmire",
        "meaning": "A soft boggy area of land that gives way underfoot; an awkward, complex, or hazardous situation.",
        "examples": [
          "The rain had turned the field into a quagmire.",
          "He found himself in a legal quagmire."
        ]
      },
      {
        "id": "g48w11",
        "word": "quail",
        "meaning": "To feel or show fear or apprehension.",
        "examples": [
          "She quailed at the thought of speaking in public.",
          "The bully expected his victim to quail, but he stood his ground."
        ]
      },
      {
        "id": "g48w12",
        "word": "qualification",
        "meaning": "A quality or accomplishment that makes someone suitable for a particular job or activity.",
        "examples": [
          "She has the necessary qualifications for the job.",
          "His only qualification was his enthusiasm."
        ]
      },
      {
        "id": "g48w13",
        "word": "qualified",
        "meaning": "Officially recognized as being trained to perform a particular job; certified.",
        "examples": [
          "He is a qualified accountant.",
          "Her support for the proposal was qualified, as she had some reservations."
        ]
      },
      {
        "id": "g48w14",
        "word": "qualify",
        "meaning": "Be entitled to a particular benefit or privilege by fulfilling a necessary condition.",
        "examples": [
          "You may qualify for a discount if you are a student.",
          "He failed to qualify for the final race."
        ]
      },
      {
        "id": "g48w15",
        "word": "qualm",
        "meaning": "An uneasy feeling of doubt, worry, or fear, especially about one's own conduct; a misgiving.",
        "examples": [
          "He had no qualms about lying to get what he wanted.",
          "She felt a qualm of guilt about not telling the truth."
        ]
      },
      {
        "id": "g48w16",
        "word": "quandary",
        "meaning": "A state of perplexity or uncertainty over what to do in a difficult situation.",
        "examples": [
          "I was in a quandary about whether to accept the job offer.",
          "She was in a quandary over which dress to wear to the party."
        ]
      },
      {
        "id": "g48w17",
        "word": "quarantine",
        "meaning": "A state, period, or place of isolation in which people or animals that have arrived from elsewhere or been exposed to infectious or contagious disease are placed.",
        "examples": [
          "The ship was put in quarantine for two weeks.",
          "The dog had to be kept in quarantine before it could enter the country."
        ]
      },
      {
        "id": "g48w18",
        "word": "quarry",
        "meaning": "A place, typically a large, deep pit, from which stone or other materials are or have been extracted.",
        "examples": [
          "The old quarry is now a nature reserve.",
          "The police were in hot pursuit of their quarry."
        ]
      },
      {
        "id": "g48w19",
        "word": "quash",
        "meaning": "Reject or void, especially by legal procedure.",
        "examples": [
          "The judge quashed the conviction.",
          "He tried to quash the rumors that he was resigning."
        ]
      },
      {
        "id": "g48w20",
        "word": "quay",
        "meaning": "A concrete, stone, or metal platform lying alongside or projecting into water for loading and unloading ships.",
        "examples": [
          "The ship was moored at the quay.",
          "They watched the boats from the quay."
        ]
      },
      {
        "id": "g48w21",
        "word": "quell",
        "meaning": "To put an end to (a rebellion or other disorder), typically by the use of force.",
        "examples": [
          "The police were called in to quell the riot.",
          "She tried to quell her fears before the exam."
        ]
      },
      {
        "id": "g48w22",
        "word": "quenching",
        "meaning": "Satisfy (one's thirst) by drinking.",
        "examples": [
          "Nothing is more quenching on a hot day than a cold glass of water.",
          "He spent the afternoon quenching his thirst with lemonade."
        ]
      },
      {
        "id": "g48w23",
        "word": "querulous",
        "meaning": "Complaining in a petulant or whining manner.",
        "examples": [
          "The querulous child was never happy with anything.",
          "He had a querulous tone of voice that was very annoying."
        ]
  
      },
      {
        "id": "g48w24",
        "word": "query",
        "meaning": "A question, especially one addressed to an official or organization.",
        "examples": [
          "I have a query about my bill.",
          "The computer program allows you to query the database for specific information."
        ]
      },
      {
        "id": "g48w25",
        "word": "queue",
        "meaning": "A line or sequence of people or vehicles awaiting their turn to be attended to or to proceed.",
        "examples": [
          "We had to wait in a long queue to get into the concert.",
          "There was a queue of cars waiting at the traffic lights."
        ]
      },
      {
        "id": "g48w26",
        "word": "quibble",
        "meaning": "To argue or raise objections about a trivial matter.",
        "examples": [
          "They were quibbling over a few pennies.",
          "Don't quibble with me about the details."
        ]
      },
      {
        "id": "g48w27",
        "word": "quiescence",
        "meaning": "A state or period of inactivity or dormancy.",
        "examples": [
          "The volcano had been in a state of quiescence for many years.",
          "After a period of quiescence, the company's stock price began to rise again."
        ]
      },
      {
        "id": "g48w28",
        "word": "quiescent",
        "meaning": "In a state or period of inactivity or dormancy.",
        "examples": [
          "The political situation was quiescent for a time.",
          "The quiescent volcano suddenly erupted."
        ]
      },
      {
        "id": "g48w29",
        "word": "quintessential",
        "meaning": "Representing the most perfect or typical example of a quality or class.",
        "examples": [
          "He was the quintessential English gentleman.",
          "The film is the quintessential romantic comedy."
        ]
      },
      {
        "id": "g48w30",
        "word": "quip",
        "meaning": "A witty remark.",
        "examples": [
          "He made a witty quip that made everyone laugh.",
          "She was known for her clever quips."
        ]
      },
      {
        "id": "g48w31",
        "word": "quirky",
        "meaning": "Having or characterized by peculiar or unexpected traits or aspects.",
        "examples": [
          "She has a quirky sense of humor.",
          "The film is a quirky comedy with a lot of charm."
        ]
  
      },
      {
        "id": "g48w32",
        "word": "quisling",
        "meaning": "A traitor who collaborates with an enemy force occupying their country.",
        "examples": [
          "He was denounced as a quisling for his collaboration with the enemy.",
          "The government was full of quislings who were secretly working for the other side."
        ]
      },
      {
        "id": "g48w33",
        "word": "quiver",
        "meaning": "To tremble or shake with a slight rapid motion.",
        "examples": [
          "Her lip began to quiver as she held back the tears.",
          "The leaves of the trees quivered in the breeze."
        ]
      },
      {
        "id": "g48w34",
        "word": "quixotic",
        "meaning": "Exceedingly idealistic; unrealistic and impractical.",
        "examples": [
          "He had a quixotic dream of world peace.",
          "Her quixotic quest to save every stray animal was admirable but ultimately futile."
        ]
      },
      {
        "id": "g48w35",
        "word": "quizzical",
        "meaning": "(of a person's expression or behavior) indicating mild or amused puzzlement.",
        "examples": [
          "She gave me a quizzical look when I told her my plan.",
          "He had a quizzical smile on his face."
        ]
      },
      {
        "id": "g48w36",
        "word": "quorum",
        "meaning": "The minimum number of members of an assembly or society that must be present at any of its meetings to make the proceedings of that meeting valid.",
        "examples": [
          "The meeting was adjourned because there was no quorum.",
          "We need a quorum of at least ten members to vote on the proposal."
        ]
      },
      {
        "id": "g48w37",
        "word": "quotidian",
        "meaning": "Of or occurring every day; daily.",
        "examples": [
          "The quotidian routine of her life was starting to bore her.",
          "He was tired of the quotidian grind of his job."
        ]
      },
      {
        "id": "g48w38",
        "word": "rabid",
        "meaning": "Having or proceeding from an extreme or fanatical support of or belief in something.",
        "examples": [
          "He was a rabid supporter of the team.",
          "The rabid dog was a danger to the community."
        ]
      },
      {
        "id": "g48w39",
        "word": "raconteur",
        "meaning": "A person who tells anecdotes in a skillful and amusing way.",
        "examples": [
          "He was a brilliant raconteur who could hold an audience spellbound for hours.",
          "She was a gifted raconteur and a much sought-after dinner guest."
        ]
      },
      {
        "id": "g48w40",
        "word": "radical",
        "meaning": "(especially of change or action) relating to or affecting the fundamental nature of something; far-reaching or thorough.",
        "examples": [
          "The new government has promised radical reforms.",
          "He had some radical ideas about how to solve the problem."
        ]
      },
      {
        "id": "g48w41",
        "word": "raffish",
        "meaning": "Unconventional and slightly disreputable, especially in an attractive way.",
        "examples": [
          "He had a raffish charm that women found irresistible.",
          "The raffish artist was known for his bohemian lifestyle."
        ]
      },
      {
        "id": "g48w42",
        "word": "raft",
        "meaning": "A flat buoyant structure of timber or other materials fastened together, used as a boat or floating platform.",
        "examples": [
          "They built a raft to escape from the deserted island.",
          "We saw a raft of ducks on the pond."
        ]
      },
      {
        "id": "g48w43",
        "word": "ragamuffin",
        "meaning": "A person, typically a child, in ragged, dirty clothes.",
        "examples": [
          "The little ragamuffin looked up at me with big, sad eyes.",
          "The streets were full of ragamuffins begging for food."
        ]
      },
      {
        "id": "g48w44",
        "word": "rail",
        "meaning": "To complain or protest strongly and persistently about.",
        "examples": [
          "He railed against the injustices of the system.",
          "She railed at her husband for being late."
        ]
      },
      {
        "id": "g48w45",
        "word": "raiment",
        "meaning": "Clothing.",
        "examples": [
          "The king was dressed in fine raiment.",
          "She wore simple raiment, but she was still beautiful."
        ]
      },
      {
        "id": "g48w46",
        "word": "rakish",
        "meaning": "Having or displaying a dashing, jaunty, or slightly disreputable quality or appearance.",
        "examples": [
          "He wore his hat at a rakish angle.",
          "She had a rakish smile that was both charming and mischievous."
        ]
      },
      {
        "id": "g48w47",
        "word": "ramification",
        "meaning": "A complex or unwelcome consequence of an action or event.",
        "examples": [
          "The decision to close the factory had serious ramifications for the local community.",
          "He had not considered the ramifications of his actions."
        ]
      },
      {
        "id": "g48w48",
        "word": "ramifications",
        "meaning": "The complex or unwelcome consequences of an action or event.",
        "examples": [
          "The ramifications of the new law were not fully understood at first.",
          "He was aware of the potential ramifications of his decision."
        ]
      },
      {
        "id": "g48w49",
        "word": "rampant",
        "meaning": "(especially of something unwelcome or unpleasant) flourishing or spreading unchecked.",
        "examples": [
          "Corruption was rampant in the country.",
          "The rampant growth of the weeds was choking the other plants."
        ]
      },
      {
        "id": "g48w50",
        "word": "rampart",
        "meaning": "A defensive wall of a castle or walled city, having a broad top with a walkway and typically a stone parapet.",
        "examples": [
          "The soldiers stood on the ramparts, watching for the enemy.",
          "The city was surrounded by a high rampart."
        ]
      },
      {
        "id": "g48w51",
        "word": "rancorous",
        "meaning": "Characterized by bitterness or resentment.",
        "examples": [
          "The rancorous dispute between the two families had been going on for years.",
          "He had a rancorous and unforgiving nature."
        ]
      },
      {
        "id": "g48w52",
        "word": "ranger",
        "meaning": "A keeper of a park, forest, or area of countryside.",
        "examples": [
          "The park ranger warned us about the dangers of bears.",
          "The forest ranger helped us find our way back to the trail."
        ]
      },
      {
        "id": "g48w53",
        "word": "rankle",
        "meaning": "(of a comment, event, or fact) cause annoyance or resentment that persists.",
        "examples": [
          "His unfair criticism continued to rankle her.",
          "The memory of his betrayal still rankled."
        ]
      },
      {
        "id": "g48w54",
        "word": "rankled",
        "meaning": "Caused annoyance or resentment that persists.",
        "examples": [
          "She was rankled by his condescending tone.",
          "The injustice of the situation rankled him for a long time."
        ]
      },
      {
        "id": "g48w55",
        "word": "ranks",
        "meaning": "The members of a particular group or organization.",
        "examples": [
          "He rose through the ranks to become a general.",
          "She was a respected member of the ranks of her profession."
        ]
      },
      {
        "id": "g48w56",
        "word": "rapacious",
        "meaning": "Aggressively greedy or grasping.",
        "examples": [
          "The rapacious landlord was always raising the rent.",
          "He had a rapacious appetite for power."
        ]
      },
      {
        "id": "g48w57",
        "word": "rapprochement",
        "meaning": "(especially in international relations) an establishment or resumption of harmonious relations.",
        "examples": [
          "The two countries have made a historic rapprochement.",
          "There has been a rapprochement between the two rival factions."
        ]
      },
      {
        "id": "g48w58",
        "word": "rapt",
        "meaning": "Completely fascinated by what one is seeing or hearing.",
        "examples": [
          "The children listened with rapt attention to the story.",
          "She had a rapt expression on her face as she watched the ballet."
        ]
      },
      {
        "id": "g48w59",
        "word": "rapturous",
        "meaning": "Characterized by, feeling, or expressing great pleasure or enthusiasm.",
        "examples": [
          "The audience gave the performers a rapturous applause.",
          "She was in a rapturous mood after winning the lottery."
        ]
      },
      {
        "id": "g48w60",
        "word": "rarefied",
        "meaning": "Of, belonging to, or appealing to an exclusive group; select.",
        "examples": [
          "She lived in the rarefied world of high fashion.",
          "The rarefied atmosphere of the mountain peak made it difficult to breathe."
        ]
      }
    ]
  }