{
    "id": "group50",
    "words": [
      {
        "id": "g50w1",
        "word": "rejoicing",
        "meaning": "Great joy; jubilation.",
        "examples": [
          "There was great rejoicing in the streets when the war was over.",
          "The news of their victory was met with widespread rejoicing."
        ]
      },
      {
        "id": "g50w2",
        "word": "rejoinder",
        "meaning": "A sharp or witty reply.",
        "examples": [
          "She made a clever rejoinder to his sarcastic comment.",
          "His witty rejoinder left the audience laughing."
        ]
      },
      {
        "id": "g50w3",
        "word": "rejuvenated",
        "meaning": "Made to look or feel younger, fresher, or more lively.",
        "examples": [
          "She felt rejuvenated after her spa vacation.",
          "The new manager's enthusiasm rejuvenated the entire team."
        ]
      },
      {
        "id": "g50w4",
        "word": "relegate",
        "meaning": "Consign or dismiss to an inferior rank or position.",
        "examples": [
          "He was relegated to a minor role in the company.",
          "The team was relegated to the second division after a poor season."
        ]
      },
      {
        "id": "g50w5",
        "word": "relent",
        "meaning": "Abandon or mitigate a harsh intention or cruel treatment.",
        "examples": [
          "The storm finally began to relent.",
          "Her parents eventually relented and let her go to the concert."
        ]
      },
      {
        "id": "g50w6",
        "word": "relentless",
        "meaning": "Incessantly intense.",
        "examples": [
          "She was a relentless competitor who never gave up.",
          "The relentless heat of the desert was exhausting."
        ]
      },
      {
        "id": "g50w7",
        "word": "relevant",
        "meaning": "Closely connected or appropriate to what is being done or considered.",
        "examples": [
          "Please stick to the relevant facts of the case.",
          "Her work experience is highly relevant to this position."
        ]
      },
      {
        "id": "g50w8",
        "word": "relinquish",
        "meaning": "Voluntarily cease to keep or claim; give up.",
        "examples": [
          "He was forced to relinquish control of the company.",
          "She relinquished her claim to the inheritance."
        ]
      },
      {
        "id": "g50w9",
        "word": "relish",
        "meaning": "Great enjoyment.",
        "examples": [
          "She savored every bite of the delicious meal with great relish.",
          "He takes great relish in telling stories about his travels."
        ]
      },
      {
        "id": "g50w10",
        "word": "remedial",
        "meaning": "Intended as a remedy or cure.",
        "examples": [
          "He had to take remedial math classes to catch up with his peers.",
          "The company took remedial action to address the customer complaints."
        ]
      },
      {
        "id": "g50w11",
        "word": "reminiscent",
        "meaning": "Tending to remind one of something.",
        "examples": [
          "The smell of cinnamon is reminiscent of my grandmother's kitchen.",
          "The movie's plot is reminiscent of a classic fairy tale."
        ]
      },
      {
        "id": "g50w12",
        "word": "remiss",
        "meaning": "Lacking care or attention to duty; negligent.",
        "examples": [
          "It was remiss of me to forget to thank her.",
          "The company was remiss in its safety procedures."
        ]
      },
      {
        "id": "g50w13",
        "word": "remonstrate",
        "meaning": "Make a forcefully reproachful protest.",
        "examples": [
          "The parents remonstrated with the school about the new policy.",
          "He remonstrated against the unfair decision."
        ]
      },
      {
        "id": "g50w14",
        "word": "remorse",
        "meaning": "Deep regret or guilt for a wrong committed.",
        "examples": [
          "He felt a deep sense of remorse for his actions.",
          "She showed no remorse for the crime she had committed."
        ]
      },
      {
        "id": "g50w15",
        "word": "remote",
        "meaning": "(of a place) situated far from the main centers of population; distant.",
        "examples": [
          "They lived in a remote village in the mountains.",
          "There is a remote possibility that he might survive."
        ]
      },
      {
        "id": "g50w16",
        "word": "remunerated",
        "meaning": "Paid for services rendered or work done.",
        "examples": [
          "The interns were not remunerated for their work.",
          "She was well remunerated for her expertise."
        ]
      },
      {
        "id": "g50w17",
        "word": "remuneration",
        "meaning": "Money paid for work or a service.",
        "examples": [
          "The job offers a competitive salary and generous remuneration package.",
          "He received no remuneration for his volunteer work."
        ]
      },
      {
        "id": "g50w18",
        "word": "renaissance",
        "meaning": "A revival of or renewed interest in something.",
        "examples": [
          "The city is undergoing a cultural renaissance.",
          "The band's new album marks a renaissance in their career."
        ]
      },
      {
        "id": "g50w19",
        "word": "rend",
        "meaning": "Tear (something) into two or more pieces.",
        "examples": [
          "The sound of the explosion rent the air.",
          "He was so angry he wanted to rend his clothes."
        ]
      },
      {
        "id": "g50w20",
        "word": "render",
        "meaning": "Provide or give (a service, help, etc.).",
        "examples": [
          "The new technology will render my old computer obsolete.",
          "The artist tried to render the beauty of the sunset in his painting."
        ]
      },
      {
        "id": "g50w21",
        "word": "renege",
        "meaning": "Go back on a promise, undertaking, or contract.",
        "examples": [
          "He reneged on his promise to help me.",
          "The company reneged on its agreement to provide a refund."
        ]
      },
      {
        "id": "g50w22",
        "word": "renounce",
        "meaning": "Formally declare one's abandonment of (a claim, right, or possession).",
        "examples": [
          "The king was forced to renounce his throne.",
          "She renounced her citizenship of her home country."
        ]
      },
      {
        "id": "g50w23",
        "word": "renowned",
        "meaning": "Known or talked about by many people; famous.",
        "examples": [
          "She is a renowned expert in her field.",
          "The restaurant is renowned for its excellent cuisine."
        ]
      },
      {
        "id": "g50w24",
        "word": "rent",
        "meaning": "A large tear in a piece of fabric.",
        "examples": [
          "There was a large rent in the sleeve of his shirt.",
          "The political party was rent by internal squabbles."
        ]
      },
      {
        "id": "g50w25",
        "word": "renumeration",
        "meaning": "A misspelling of 'remuneration', meaning payment for work or services.",
        "examples": [
          "The renumeration for the job was not very high.",
          "He was seeking better renumeration in his next position."
        ]
      },
      {
        "id": "g50w26",
        "word": "reparation",
        "meaning": "The making of amends for a wrong one has done, by paying money to or otherwise helping those who have been wronged.",
        "examples": [
          "The country was forced to pay reparations for the war damage.",
          "He offered her a sincere apology as a form of reparation."
        ]
      },
      {
        "id": "g50w27",
        "word": "repast",
        "meaning": "A meal.",
        "examples": [
          "They enjoyed a simple repast of bread and cheese.",
          "The weary travelers were grateful for the hearty repast."
        ]
      },
      {
        "id": "g50w28",
        "word": "repent",
        "meaning": "Feel or express sincere regret or remorse about one's wrongdoing or sin.",
        "examples": [
          "He repented of his sins and asked for forgiveness.",
          "She repented her harsh words to her friend."
        ]
      },
      {
        "id": "g50w29",
        "word": "repercussion",
        "meaning": "An unintended consequence occurring some time after an event or action, especially an unwelcome one.",
        "examples": [
          "The decision to close the factory had serious repercussions for the local community.",
          "He had not considered the repercussions of his actions."
        ]
      },
      {
        "id": "g50w30",
        "word": "repertoire",
        "meaning": "A stock of plays, dances, or pieces that a company or a performer knows or is prepared to perform.",
        "examples": [
          "The orchestra has a wide repertoire of classical music.",
          "The comedian's repertoire of jokes was starting to get old."
        ]
      },
      {
        "id": "g50w31",
        "word": "replenish",
        "meaning": "Fill (something) up again.",
        "examples": [
          "He stopped at the oasis to replenish his water supply.",
          "The store needs to replenish its stock of popular items."
        ]
      },
      {
        "id": "g50w32",
        "word": "replete",
        "meaning": "Filled or well-supplied with something.",
        "examples": [
          "The book is replete with interesting facts and anecdotes.",
          "The garden was replete with colorful flowers."
        ]
      },
      {
        "id": "g50w33",
        "word": "repose",
        "meaning": "A state of rest, sleep, or tranquility.",
        "examples": [
          "She sought a moment of repose in the quiet garden.",
          "His face was in a state of peaceful repose."
        ]
      },
      {
        "id": "g50w34",
        "word": "reprehensible",
        "meaning": "Deserving censure or condemnation.",
        "examples": [
          "His behavior was reprehensible and he was rightly punished.",
          "The company's reprehensible actions were exposed in the media."
        ]
      },
      {
        "id": "g50w35",
        "word": "repress",
        "meaning": "Subdue (someone or something) by force.",
        "examples": [
          "The government repressed all forms of dissent.",
          "She tried to repress her feelings of anger."
        ]
      },
      {
        "id": "g50w36",
        "word": "reprimand",
        "meaning": "A formal expression of disapproval.",
        "examples": [
          "He received a severe reprimand for his misconduct.",
          "The teacher gave the student a reprimand for being late."
        ]
      },
      {
        "id": "g50w37",
        "word": "reprisal",
        "meaning": "An act of retaliation.",
        "examples": [
          "The attack was a reprisal for the earlier bombing.",
          "He feared a reprisal from his enemies."
        ]
      },
      {
        "id": "g50w38",
        "word": "reprise",
        "meaning": "A repeated passage in music.",
        "examples": [
          "The song's catchy chorus was reprised several times.",
          "He reprised his role as the hero in the sequel."
        ]
      },
      {
        "id": "g50w39",
        "word": "reproach",
        "meaning": "Address (someone) in such a way as to express disapproval or disappointment.",
        "examples": [
          "She reproached him for his selfishness.",
          "His actions brought reproach upon the whole family."
        ]
      },
      {
        "id": "g50w40",
        "word": "reprobate",
        "meaning": "An unprincipled person (often used humorously or affectionately).",
        "examples": [
          "He was a charming old reprobate who was always getting into trouble.",
          "The group of friends were a bunch of lovable reprobates."
        ]
      },
      {
        "id": "g50w41",
        "word": "reprove",
        "meaning": "Reprimand or censure (someone).",
        "examples": [
          "The teacher gently reproved the student for not paying attention.",
          "He was reproved for his laziness."
        ]
      },
      {
        "id": "g50w42",
        "word": "repudiate",
        "meaning": "Refuse to accept or be associated with.",
        "examples": [
          "He repudiated all the charges against him.",
          "The company repudiated the claims made in the newspaper article."
        ]
      },
      {
        "id": "g50w43",
        "word": "repugnant",
        "meaning": "Extremely distasteful; unacceptable.",
        "examples": [
          "The idea of eating insects is repugnant to many people.",
          "His racist views are repugnant to all decent people."
        ]
      },
      {
        "id": "g50w44",
        "word": "repulse",
        "meaning": "Drive back (an attack or attacking enemy) by force.",
        "examples": [
          "The army repulsed the enemy attack.",
          "She was repulsed by his crude behavior."
        ]
      },
      {
        "id": "g50w45",
        "word": "reputed",
        "meaning": "Be generally said or believed to do something or to have a particular characteristic.",
        "examples": [
          "He is reputed to be the richest man in the country.",
          "The restaurant is reputed to have the best pizza in town."
        ]
      },
      {
        "id": "g50w46",
        "word": "requisite",
        "meaning": "Made necessary by particular circumstances or regulations.",
        "examples": [
          "A university degree is a requisite for this job.",
          "He had all the requisite skills for the position."
        ]
      },
      {
        "id": "g50w47",
        "word": "requite",
        "meaning": "Make appropriate return for (a favor, service, or wrongdoing).",
        "examples": [
          "He requited her love with kindness and affection.",
          "His good deeds were requited with ingratitude."
        ]
      },
      {
        "id": "g50w48",
        "word": "rescind",
        "meaning": "Revoke, cancel, or repeal (a law, order, or agreement).",
        "examples": [
          "The company rescinded its job offer.",
          "The government rescinded the unpopular tax."
        ]
      },
      {
        "id": "g50w49",
        "word": "reservation",
        "meaning": "A qualification to an expression of agreement or approval; a doubt.",
        "examples": [
          "I have some reservations about his plan.",
          "I'll accept your offer, but with some reservations."
        ]
      },
      {
        "id": "g50w50",
        "word": "resignation",
        "meaning": "An act of retiring or giving up a position.",
        "examples": [
          "He handed in his resignation to his boss.",
          "She accepted her fate with resignation."
        ]
      },
      {
        "id": "g50w51",
        "word": "resigned",
        "meaning": "Having accepted something unpleasant that one cannot do anything about.",
        "examples": [
          "He was resigned to the fact that he would never be a famous actor.",
          "She gave a resigned sigh and went back to her work."
        ]
      },
      {
        "id": "g50w52",
        "word": "resilient",
        "meaning": "(of a person or animal) able to withstand or recover quickly from difficult conditions.",
        "examples": [
          "She is a resilient woman who has overcome many challenges.",
          "The local economy has proven to be very resilient."
        ]
      },
      {
        "id": "g50w53",
        "word": "resolute",
        "meaning": "Admirably purposeful, determined, and unwavering.",
        "examples": [
          "He was resolute in his decision to quit his job.",
          "She remained resolute in her beliefs despite the criticism."
        ]
      },
      {
        "id": "g50w54",
        "word": "resolution",
        "meaning": "A firm decision to do or not to do something.",
        "examples": [
          "My New Year's resolution is to exercise more.",
          "The two countries reached a peaceful resolution to their conflict."
        ]
      },
      {
        "id": "g50w55",
        "word": "resolve",
        "meaning": "Settle or find a solution to (a problem, dispute, or contentious matter).",
        "examples": [
          "We need to resolve this issue as soon as possible.",
          "He resolved to work harder and improve his grades."
        ]
      },
      {
        "id": "g50w56",
        "word": "resolved",
        "meaning": "Firmly determined to do something.",
        "examples": [
          "She was resolved to finish the marathon, no matter how tired she was.",
          "The issue has finally been resolved to everyone's satisfaction."
        ]
      },
      {
        "id": "g50w57",
        "word": "resonant",
        "meaning": "(of sound) deep, clear, and continuing to sound or ring.",
        "examples": [
          "He had a deep, resonant voice.",
          "The music was resonant with emotion."
        ]
      },
      {
        "id": "g50w58",
        "word": "resourceful",
        "meaning": "Having the ability to find quick and clever ways to overcome difficulties.",
        "examples": [
          "She is a resourceful person who can always find a solution to a problem.",
          "He was a resourceful and determined leader."
        ]
      },
      {
        "id": "g50w59",
        "word": "respectively",
        "meaning": "Separately or individually and in the order already mentioned.",
        "examples": [
          "John and Mary won the first and second prizes, respectively.",
          "The two cars cost $20,000 and $30,000, respectively."
        ]
      },
      {
        "id": "g50w60",
        "word": "respite",
        "meaning": "A short period of rest or relief from something difficult or unpleasant.",
        "examples": [
          "The rain provided a welcome respite from the heat.",
          "They worked for hours without a respite."
        ]
      }
    ]
  }