{
    "id": "group44",
    "words": [
      {
        "id": "g44w1",
        "word": "perverse",
        "meaning": "Showing a deliberate and obstinate desire to behave in a way that is unreasonable or unacceptable, often in spite of the consequences.",
        "examples": [
          "She took a perverse pleasure in arguing with her parents.",
          "It would be perverse to quit now, so close to finishing the project."
        ]
      },
      {
        "id": "g44w2",
        "word": "pesky",
        "meaning": "Causing trouble; annoying.",
        "examples": [
          "These pesky mosquitoes are ruining our picnic.",
          "I have to deal with some pesky paperwork before I can leave."
        ]
      },
      {
        "id": "g44w3",
        "word": "pestilence",
        "meaning": "A fatal epidemic disease, especially bubonic plague.",
        "examples": [
          "The pestilence swept through the city, leaving thousands dead.",
          "In the Middle Ages, pestilence was a constant threat."
        ]
      },
      {
        "id": "g44w4",
        "word": "petition",
        "meaning": "A formal written request, typically one signed by many people, appealing to authority with respect to a particular cause.",
        "examples": [
          "The residents signed a petition to protest the new development.",
          "They submitted a petition to the city council for a new park."
        ]
      },
      {
        "id": "g44w5",
        "word": "petrous",
        "meaning": "Like stone, especially in hardness.",
        "examples": [
          "The petrous portion of the temporal bone is extremely dense.",
          "He had a petrous resolve that could not be shaken."
        ]
      },
      {
        "id": "g44w6",
        "word": "petulance",
        "meaning": "The quality of being childishly sulky or bad-tempered.",
        "examples": [
          "His petulance was evident in his refusal to speak to anyone.",
          "She stormed out of the room in a fit of petulance."
        ]
      },
      {
        "id": "g44w7",
        "word": "petulant",
        "meaning": "Childishly sulky or bad-tempered.",
        "examples": [
          "The petulant child threw his toy on the floor.",
          "He became petulant when he didn't get his way."
        ]
      },
      {
        "id": "g44w8",
        "word": "phalanx",
        "meaning": "A body of troops or police officers, standing or moving in close formation.",
        "examples": [
          "A phalanx of police officers guarded the entrance.",
          "The ancient Greek army was famous for its phalanx formation."
        ]
      },
      {
        "id": "g44w9",
        "word": "phantasmagorical",
        "meaning": "Having a fantastic or deceptive appearance, as something in a dream or created by the imagination.",
        "examples": [
          "The artist's paintings were filled with phantasmagorical images.",
          "The play was a phantasmagorical journey into the subconscious mind."
        ]
      },
      {
        "id": "g44w10",
        "word": "phenomena",
        "meaning": "The plural of phenomenon; facts or situations that are observed to exist or happen, especially ones whose cause or explanation is in question.",
        "examples": [
          "Natural phenomena like earthquakes and volcanoes can be devastating.",
          "The scientist was studying a range of unexplained phenomena."
        ]
      },
      {
        "id": "g44w11",
        "word": "phenomenon",
        "meaning": "A fact or situation that is observed to exist or happen, especially one whose cause or explanation is in question.",
        "examples": [
          "The aurora borealis is a beautiful natural phenomenon.",
          "The rise of social media is a recent social phenomenon."
        ]
      },
      {
        "id": "g44w12",
        "word": "Philadelphia lawyer",
        "meaning": "A lawyer who is shrewd and skillful in the details of law.",
        "examples": [
          "It would take a Philadelphia lawyer to get him out of this mess.",
          "The contract was so complicated, you'd need a Philadelphia lawyer to understand it."
        ]
      },
      {
        "id": "g44w13",
        "word": "philander",
        "meaning": "Of a man, to readily or frequently enter into casual sexual relationships with women.",
        "examples": [
          "He was known to philander, much to his wife's dismay.",
          "The tabloid magazines were full of stories about the actor's philandering."
        ]
      },
      {
        "id": "g44w14",
        "word": "philanthropist",
        "meaning": "A person who seeks to promote the welfare of others, especially by the generous donation of money to good causes.",
        "examples": [
          "The wealthy philanthropist donated millions to charity.",
          "She was a well-known philanthropist and humanitarian."
        ]
      },
      {
        "id": "g44w15",
        "word": "philanthropy",
        "meaning": "The desire to promote the welfare of others, expressed especially by the generous donation of money to good causes.",
        "examples": [
          "His philanthropy has had a major impact on the community.",
          "The foundation is dedicated to philanthropy and social justice."
        ]
      },
      {
        "id": "g44w16",
        "word": "philistine",
        "meaning": "A person who is hostile or indifferent to culture and the arts, or who has no understanding of them.",
        "examples": [
          "He called me a philistine because I don't like opera.",
          "Only a philistine would fail to appreciate the beauty of this painting."
        ]
      },
      {
        "id": "g44w17",
        "word": "phlegmatic",
        "meaning": "(of a person) having an unemotional and stolidly calm disposition.",
        "examples": [
          "The phlegmatic man remained calm even in the face of danger.",
          "She has a phlegmatic temperament and is not easily upset."
        ]
      },
      {
        "id": "g44w18",
        "word": "phobia",
        "meaning": "An extreme or irrational fear of or aversion to something.",
        "examples": [
          "He has a phobia of spiders.",
          "She sought therapy to overcome her phobia of flying."
        ]
      },
      {
        "id": "g44w19",
        "word": "phoenix",
        "meaning": "A mythological bird that is said to be reborn from its ashes.",
        "examples": [
          "Like a phoenix rising from the ashes, she overcame her adversity.",
          "The city was rebuilt like a phoenix after the devastating fire."
        ]
      },
      {
        "id": "g44w20",
        "word": "phony",
        "meaning": "Not genuine; fraudulent.",
        "examples": [
          "He was a phony who pretended to be a doctor.",
          "She could spot a phony from a mile away."
        ]
      },
      {
        "id": "g44w21",
        "word": "physiognomy",
        "meaning": "A person's facial features or expression, especially when regarded as indicative of character or ethnic origin.",
        "examples": [
          "He had a kind and gentle physiognomy.",
          "The artist was skilled at capturing the physiognomy of her subjects."
        ]
      },
      {
        "id": "g44w22",
        "word": "physiological",
        "meaning": "Relating to the way in which a living organism or bodily part functions.",
        "examples": [
          "Stress can have a number of physiological effects on the body.",
          "The doctor explained the physiological reasons for her illness."
        ]
      },
      {
        "id": "g44w23",
        "word": "picaresque",
        "meaning": "Relating to an episodic style of fiction dealing with the adventures of a rough and dishonest but appealing hero.",
        "examples": [
          "'Don Quixote' is a classic example of a picaresque novel.",
          "The film was a picaresque journey through the criminal underworld."
        ]
  
      },
      {
        "id": "g44w24",
        "word": "picayune",
        "meaning": "Petty; worthless.",
        "examples": [
          "Don't bother me with such picayune details.",
          "He was always arguing over picayune matters."
        ]
      },
      {
        "id": "g44w25",
        "word": "picturesque",
        "meaning": "Visually attractive, especially in a quaint or charming way.",
        "examples": [
          "The picturesque village was a popular tourist destination.",
          "We had a wonderful view of the picturesque coastline."
        ]
      },
      {
        "id": "g44w26",
        "word": "piebald",
        "meaning": "(of a horse) having irregular patches of two colors, typically black and white.",
        "examples": [
          "The piebald pony was a favorite among the children.",
          "He rode a magnificent piebald stallion."
        ]
      },
      {
        "id": "g44w27",
        "word": "pied",
        "meaning": "Having two or more different colors.",
        "examples": [
          "The Pied Piper of Hamelin is a famous folktale.",
          "The pied wagtail is a common bird in Europe."
        ]
      },
      {
        "id": "g44w28",
        "word": "piety",
        "meaning": "The quality of being religious or reverent.",
        "examples": [
          "Her piety was evident in her daily prayers and acts of charity.",
          "He was a man of great piety and devotion."
        ]
      },
      {
        "id": "g44w29",
        "word": "pilfer",
        "meaning": "Steal (typically things of little value).",
        "examples": [
          "He was caught pilfering office supplies.",
          "The children would often pilfer apples from the neighbor's tree."
        ]
      },
      {
        "id": "g44w30",
        "word": "pillage",
        "meaning": "Rob (a place) using violence, especially in wartime.",
        "examples": [
          "The invading army pillaged the town.",
          "The pirates pillaged the coastal villages."
        ]
      },
      {
        "id": "g44w31",
        "word": "pillory",
        "meaning": "Attack or ridicule publicly.",
        "examples": [
          "The politician was pilloried in the press for his controversial remarks.",
          "She was pilloried by her classmates for her unusual dress sense."
        ]
      },
      {
        "id": "g44w32",
        "word": "pine",
        "meaning": "Suffer a mental and physical decline, especially because of a broken heart.",
        "examples": [
          "She pined for her lost love.",
          "He pined away after his wife's death."
        ]
      },
      {
        "id": "g44w33",
        "word": "pinnacle",
        "meaning": "The most successful point; the culmination.",
        "examples": [
          "Winning the championship was the pinnacle of his career.",
          "She reached the pinnacle of her profession at a young age."
        ]
      },
      {
        "id": "g44w34",
        "word": "pioneering",
        "meaning": "Involving new ideas or methods.",
        "examples": [
          "She was a pioneering figure in the field of computer science.",
          "The company is known for its pioneering work in renewable energy."
        ]
      },
      {
        "id": "g44w35",
        "word": "pious",
        "meaning": "Devoutly religious.",
        "examples": [
          "She was a pious woman who went to church every Sunday.",
          "He led a pious and virtuous life."
        ]
      },
      {
        "id": "g44w36",
        "word": "piquant",
        "meaning": "Having a pleasantly sharp taste or appetizing flavor.",
        "examples": [
          "The piquant sauce added a spicy kick to the dish.",
          "She told a piquant story that made everyone laugh."
        ]
      },
      {
        "id": "g44w37",
        "word": "pique",
        "meaning": "A feeling of irritation or resentment resulting from a slight, especially to one's pride.",
        "examples": [
          "He was in a fit of pique after she criticized his work.",
          "Her interest was piqued by the mysterious letter."
        ]
      },
      {
        "id": "g44w38",
        "word": "pitch",
        "meaning": "The steepness of a slope, especially of a roof.",
        "examples": [
          "The roof had a steep pitch, making it difficult to climb.",
          "He made a strong pitch for his new business idea."
        ]
      },
      {
        "id": "g44w39",
        "word": "pitfall",
        "meaning": "A hidden or unsuspected danger or difficulty.",
        "examples": [
          "One of the pitfalls of being famous is the lack of privacy.",
          "The book warns of the potential pitfalls of starting your own business."
        ]
      },
      {
        "id": "g44w40",
        "word": "pith",
        "meaning": "The essence of something.",
        "examples": [
          "The pith of his argument was that the government should do more to help the poor.",
          "She quickly got to the pith of the matter."
        ]
      },
      {
        "id": "g44w41",
        "word": "pithy",
        "meaning": "(of language or style) concise and forcefully expressive.",
        "examples": [
          "He was known for his pithy and witty remarks.",
          "She gave a pithy summary of the main points."
        ]
      },
      {
        "id": "g44w42",
        "word": "pittance",
        "meaning": "A very small or inadequate amount of money paid to someone as an allowance or wage.",
        "examples": [
          "He was paid a pittance for his hard work.",
          "She had to survive on a mere pittance."
        ]
      },
      {
        "id": "g44w43",
        "word": "pivotal",
        "meaning": "Of crucial importance in relation to the development or success of something else.",
        "examples": [
          "She played a pivotal role in the success of the project.",
          "The discovery was a pivotal moment in the history of science."
        ]
      },
      {
        "id": "g44w44",
        "word": "placard",
        "meaning": "A printed or handwritten notice or sign for public display, either fixed to a wall or carried during a demonstration.",
        "examples": [
          "The protesters carried placards with anti-war slogans.",
          "A placard on the door announced the store's opening hours."
        ]
      },
      {
        "id": "g44w45",
        "word": "placate",
        "meaning": "Make (someone) less angry or hostile.",
        "examples": [
          "He tried to placate the angry customer with a refund.",
          "She placated her crying child with a hug and a cookie."
        ]
      },
      {
        "id": "g44w46",
        "word": "placebo",
        "meaning": "A harmless pill, medicine, or procedure prescribed more for the psychological benefit to the patient than for any physiological effect.",
        "examples": [
          "The study found that the placebo had a significant effect on the patients' symptoms.",
          "Some people believe that homeopathic remedies are nothing more than placebos."
        ]
      },
      {
        "id": "g44w47",
        "word": "placid",
        "meaning": "(of a person or animal) not easily upset or excited.",
        "examples": [
          "The placid lake was a perfect mirror for the sky.",
          "She had a placid and easy-going nature."
        ]
      },
      {
        "id": "g44w48",
        "word": "plaintiff",
        "meaning": "A person who brings a case against another in a court of law.",
        "examples": [
          "The plaintiff is seeking damages for breach of contract.",
          "The judge ruled in favor of the plaintiff."
        ]
      },
      {
        "id": "g44w49",
        "word": "plaintive",
        "meaning": "Sounding sad and mournful.",
        "examples": [
          "The dog let out a plaintive howl when its owner left.",
          "She sang a plaintive ballad about lost love."
        ]
  
      },
      {
        "id": "g44w50",
        "word": "plangent",
        "meaning": "(of a sound) loud, deep, and resonant.",
        "examples": [
          "The plangent sound of the church bells filled the air.",
          "He had a plangent voice that could fill a concert hall."
        ]
      },
      {
        "id": "g44w51",
        "word": "plastic",
        "meaning": "Easily shaped or molded.",
        "examples": [
          "Clay is a plastic material that can be easily shaped.",
          "The young mind is plastic and eager to learn."
        ]
      },
      {
        "id": "g44w52",
        "word": "plasticity",
        "meaning": "The quality of being easily shaped or molded.",
        "examples": [
          "The plasticity of the brain allows it to adapt and change over time.",
          "The artist exploited the plasticity of the clay to create a beautiful sculpture."
        ]
      },
      {
        "id": "g44w53",
        "word": "platitude",
        "meaning": "A remark or statement, especially one with a moral content, that has been used too often to be interesting or thoughtful.",
        "examples": [
          "His speech was full of empty platitudes and clichés.",
          "She was tired of hearing the same old platitudes about hard work and success."
        ]
      },
      {
        "id": "g44w54",
        "word": "platonic",
        "meaning": "(of love or friendship) intimate and affectionate but not sexual.",
        "examples": [
          "They had a deep and lasting platonic friendship.",
          "Their relationship was purely platonic."
        ]
      },
      {
        "id": "g44w55",
        "word": "plaudits",
        "meaning": "Praise.",
        "examples": [
          "The play received plaudits from the critics.",
          "She deserves plaudits for her hard work and dedication."
        ]
      },
      {
        "id": "g44w56",
        "word": "plausible",
        "meaning": "(of an argument or statement) seeming reasonable or probable.",
        "examples": [
          "His explanation sounded plausible, but I'm not sure if I believe it.",
          "The police are investigating a plausible theory about the crime."
        ]
      },
      {
        "id": "g44w57",
        "word": "plea",
        "meaning": "A request made in an urgent and emotional manner.",
        "examples": [
          "She made a desperate plea for help.",
          "The defendant entered a plea of not guilty."
        ]
      },
      {
        "id": "g44w58",
        "word": "plea bargain",
        "meaning": "An arrangement between a prosecutor and a defendant whereby the defendant pleads guilty to a lesser charge in the expectation of leniency.",
        "examples": [
          "The defendant accepted a plea bargain to avoid a long prison sentence.",
          "The prosecutor offered the witness a plea bargain in exchange for her testimony."
        ]
      },
      {
        "id": "g44w59",
        "word": "plead",
        "meaning": "Make an emotional appeal.",
        "examples": [
          "He pleaded with her to stay.",
          "She pleaded her case to the judge."
        ]
      },
      {
        "id": "g44w60",
        "word": "plebeian",
        "meaning": "Of or belonging to the commoners of ancient Rome.",
        "examples": [
          "He had a rather plebeian taste in art.",
          "The aristocrats looked down on the plebeian masses."
        ]
      }
    ]
  }