{
    "id": "group59",
    "words": [
      {
        "id": "g59w1",
        "word": "to bring down the house",
        "meaning": "To cause an audience to applaud enthusiastically and loudly.",
        "examples": [
          "The comedian's hilarious routine brought down the house.",
          "Her powerful opera performance brought down the house on opening night."
        ]
      },
      {
        "id": "g59w2",
        "word": "to build upon sand",
        "meaning": "To base something on weak or unstable foundations; to be based on an unstable or unreliable foundation.",
        "examples": [
          "Their business plan was built upon sand, with no solid market research.",
          "Any attempt to build a lasting peace without addressing the root causes of conflict is to build upon sand."
        ]
      },
      {
        "id": "g59w3",
        "word": "to burn the midnight oil",
        "meaning": "To work or study late into the night.",
        "examples": [
          "She had to burn the midnight oil to finish her report on time.",
          "Students often burn the midnight oil before exams."
        ]
      },
      {
        "id": "g59w4",
        "word": "to carry the day",
        "meaning": "To win a contest, argument, or election; to be victorious.",
        "examples": [
          "Despite strong opposition, her arguments eventually carried the day.",
          "The underdog team managed to carry the day in the final minutes of the game."
        ]
      },
      {
        "id": "g59w5",
        "word": "to cool one's heels",
        "meaning": "To be kept waiting for a period of time.",
        "examples": [
          "I had to cool my heels in the waiting room for over an hour.",
          "He was left to cool his heels while the manager was on a long phone call."
        ]
      },
      {
        "id": "g59w6",
        "word": "to do one's heart good",
        "meaning": "To be beneficial or pleasing, especially in a way that makes one feel better emotionally.",
        "examples": [
          "Seeing all the volunteers helping out truly did my heart good.",
          "A long walk in nature always does her heart good."
        ]
      },
      {
        "id": "g59w7",
        "word": "to draw in one's horns",
        "meaning": "To become less aggressive or assertive; to reduce one's demands or ambitions.",
        "examples": [
          "After losing the debate, he had to draw in his horns and compromise.",
          "The company had to draw in its horns after several failed ventures."
        ]
      },
      {
        "id": "g59w8",
        "word": "to eat humble pie",
        "meaning": "To apologize and accept humiliation.",
        "examples": [
          "After his prediction was wrong, he had to eat humble pie.",
          "She had to eat humble pie when her supposed facts were proven incorrect."
        ]
      },
      {
        "id": "g59w9",
        "word": "to feather one's nest",
        "meaning": "To make money for oneself, often dishonestly or unfairly, especially when in a position of trust.",
        "examples": [
          "The corrupt official used his position to feather his own nest.",
          "Some politicians are accused of feathering their nests at public expense."
        ]
      },
      {
        "id": "g59w10",
        "word": "to flog a dead horse",
        "meaning": "To waste effort on something that is no longer possible or relevant.",
        "examples": [
          "Trying to convince him now is just flogging a dead horse.",
          "Continuing the debate is flogging a dead horse; the decision has been made."
        ]
      },
      {
        "id": "g59w11",
        "word": "to get off one's high horse",
        "meaning": "To stop acting in a superior or arrogant manner.",
        "examples": [
          "It's time for him to get off his high horse and listen to others.",
          "She needs to get off her high horse and accept that she made a mistake."
        ]
      },
      {
        "id": "g59w12",
        "word": "to get one's back up",
        "meaning": "To become angry or annoyed.",
        "examples": [
          "His rude comment really got my back up.",
          "Don't get your back up; I was only trying to help."
        ]
      },
      {
        "id": "g59w13",
        "word": "to get the sack",
        "meaning": "To be dismissed from employment.",
        "examples": [
          "He got the sack for consistently arriving late to work.",
          "If you keep making mistakes, you'll get the sack."
        ]
      },
      {
        "id": "g59w14",
        "word": "to get up on the wrong side of the bed",
        "meaning": "To be in a bad mood, for no apparent reason.",
        "examples": [
          "He's been grumpy all morning; he must have gotten up on the wrong side of the bed.",
          "Don't mind her; she just got up on the wrong side of the bed today."
        ]
      },
      {
        "id": "g59w15",
        "word": "to go up in smoke",
        "meaning": "To come to nothing; to be ruined or destroyed.",
        "examples": [
          "All their plans went up in smoke when the funding was cut.",
          "Years of hard work went up in smoke after the fire."
        ]
      },
      {
        "id": "g59w16",
        "word": "to have at one's fingertips",
        "meaning": "To have readily available and easily accessible.",
        "examples": [
          "He had all the necessary information at his fingertips.",
          "With the internet, you can have a vast amount of knowledge at your fingertips."
        ]
      },
      {
        "id": "g59w17",
        "word": "to hit the nail on the head",
        "meaning": "To describe exactly what is causing a situation or problem.",
        "examples": [
          "When you said she was feeling overwhelmed, you really hit the nail on the head.",
          "His analysis hit the nail on the head, accurately identifying the core issue."
        ]
      },
      {
        "id": "g59w18",
        "word": "to lay one's cards on the table",
        "meaning": "To reveal one's plans or intentions openly and honestly.",
        "examples": [
          "It's time we laid our cards on the table and discussed our true feelings.",
          "The negotiation began with both sides laying their cards on the table."
        ]
      },
      {
        "id": "g59w19",
        "word": "to leave no stone unturned",
        "meaning": "To try every possible course of action in order to achieve something.",
        "examples": [
          "The detective vowed to leave no stone unturned in the search for the missing child.",
          "We'll leave no stone unturned to find a solution to this problem."
        ]
      },
      {
        "id": "g59w20",
        "word": "to lionize a person",
        "meaning": "To treat (a person) as a celebrity; to give a lot of public attention and approval to (someone).",
        "examples": [
          "After winning the award, he was lionized by the media and the public.",
          "The town decided to lionize its war heroes with a parade."
        ]
      },
      {
        "id": "g59w21",
        "word": "to live in a fool's paradise",
        "meaning": "To be happy because one is unaware of potential trouble.",
        "examples": [
          "He's living in a fool's paradise if he thinks he can pass the exam without studying.",
          "The company was living in a fool's paradise, ignoring the signs of impending financial trouble."
        ]
      },
      {
        "id": "g59w22",
        "word": "to maintain the status quo",
        "meaning": "To keep things as they are; to prevent change.",
        "examples": [
          "The conservative party sought to maintain the status quo.",
          "Some people resist innovation because they prefer to maintain the status quo."
        ]
      },
      {
        "id": "g59w23",
        "word": "to make ends meet",
        "meaning": "To earn just enough money to live on.",
        "examples": [
          "With two part-time jobs, she barely managed to make ends meet.",
          "Rising inflation makes it harder for many families to make ends meet."
        ]
      },
      {
        "id": "g59w24",
        "word": "to make the best of a bad bargain",
        "meaning": "To make the most of a difficult or undesirable situation.",
        "examples": [
          "The car broke down, but we decided to make the best of a bad bargain and enjoy the walk.",
          "It wasn't the job she wanted, but she resolved to make the best of a bad bargain."
        ]
      },
      {
        "id": "g59w25",
        "word": "to pay the piper",
        "meaning": "To bear the unpleasant consequences of one's actions.",
        "examples": [
          "He enjoyed his reckless spending, but eventually, he had to pay the piper.",
          "If you break the rules, you'll eventually have to pay the piper."
        ]
      },
      {
        "id": "g59w26",
        "word": "to play possum",
        "meaning": "To pretend to be dead or unconscious in order to deceive someone.",
        "examples": [
          "The fox played possum when the hunters approached.",
          "He wasn't really asleep; he was just playing possum to avoid chores."
        ]
      },
      {
        "id": "g59w27",
        "word": "to pour oil on troubled waters",
        "meaning": "To calm a tense or difficult situation.",
        "examples": [
          "She stepped in to pour oil on troubled waters and mediate the argument.",
          "His calming words helped to pour oil on troubled waters during the heated discussion."
        ]
      },
      {
        "id": "g59w28",
        "word": "to pull one's own weight",
        "meaning": "To do one's fair share of work.",
        "examples": [
          "Everyone in the team needs to pull their own weight for the project to succeed.",
          "He's not pulling his own weight, and it's affecting the whole group."
        ]
      },
      {
        "id": "g59w29",
        "word": "to pull up stakes",
        "meaning": "To move to a different place.",
        "examples": [
          "After graduation, they decided to pull up stakes and move to a new city.",
          "The family pulled up stakes and relocated for a better job opportunity."
        ]
      },
      {
        "id": "g59w30",
        "word": "to raise Cain",
        "meaning": "To create a loud disturbance; to cause trouble.",
        "examples": [
          "If they don't fix this problem, I'm going to go down there and raise Cain.",
          "The children were raising Cain in the backyard, making a lot of noise."
        ]
      },
      {
        "id": "g59w31",
        "word": "to rub a person the wrong way",
        "meaning": "To annoy or irritate someone.",
        "examples": [
          "His condescending attitude always rubs me the wrong way.",
          "Her sarcastic comments tend to rub people the wrong way."
        ]
      },
      {
        "id": "g59w32",
        "word": "to rule the roost",
        "meaning": "To be in charge; to be the dominant person in a group or household.",
        "examples": [
          "In that family, the youngest child seems to rule the roost.",
          "She's a strong leader who rules the roost in her department."
        ]
      },
      {
        "id": "g59w33",
        "word": "to show one's hand",
        "meaning": "To reveal one's intentions, plans, or resources.",
        "examples": [
          "He tried to keep his strategy secret, but eventually, he had to show his hand.",
          "The company didn't want to show its hand too early in the negotiations."
        ]
      },
      {
        "id": "g59w34",
        "word": "to sow wild oats",
        "meaning": "To indulge in a period of reckless, irresponsible, and often promiscuous behavior, typically as a young person.",
        "examples": [
          "Before settling down, he spent a few years sowing his wild oats.",
          "She encouraged her son to experience life but warned him not to sow too many wild oats."
        ]
      },
      {
        "id": "g59w35",
        "word": "to spill the beans",
        "meaning": "To reveal a secret or tell something that was supposed to be kept secret.",
        "examples": [
          "Don't spill the beans about the surprise party!",
          "He accidentally spilled the beans about their secret plans."
        ]
      },
      {
        "id": "g59w36",
        "word": "to split hairs",
        "meaning": "To argue about very small differences or unimportant details.",
        "examples": [
          "Let's not split hairs over minor disagreements; focus on the main goal.",
          "The lawyer was known for splitting hairs in court."
        ]
      },
      {
        "id": "g59w37",
        "word": "to strike while the iron is hot",
        "meaning": "To take advantage of an opportunity when it arises.",
        "examples": [
          "The housing market is favorable, so it's time to strike while the iron is hot and buy a house.",
          "She decided to apply for the job immediately, striking while the iron was hot."
        ]
      },
      {
        "id": "g59w38",
        "word": "to take a leaf out of someone's book",
        "meaning": "To imitate someone in a particular way because you admire them or want to be like them.",
        "examples": [
          "I'm going to take a leaf out of his book and start exercising regularly.",
          "She decided to take a leaf out of her successful mentor's book."
        ]
      },
      {
        "id": "g59w39",
        "word": "to take by storm",
        "meaning": "To conquer or capture a place quickly. To be overwhelmingly successful or popular in a particular place or among a particular group of people.",
        "examples": [
          "The new band took the music scene by storm.",
          "The army managed to take the fortress by storm."
        ]
      },
      {
        "id": "g59w40",
        "word": "to take down a peg",
        "meaning": "To humble someone; to make someone less arrogant or conceited.",
        "examples": [
          "His recent failure really took him down a peg.",
          "Someone needs to take that arrogant guy down a peg or two."
        ]
      },
      {
        "id": "g59w41",
        "word": "to take French leave",
        "meaning": "To leave without permission or without saying goodbye.",
        "examples": [
          "He took French leave from the party without anyone noticing.",
          "The soldier was reprimanded for taking French leave from his post."
        ]
      },
      {
        "id": "g59w42",
        "word": "to take under one's wing",
        "meaning": "To look after and guide someone who is less experienced.",
        "examples": [
          "The experienced mentor took the new employee under her wing.",
          "He took the young, aspiring artist under his wing, offering guidance and support."
        ]
      },
      {
        "id": "g59w43",
        "word": "to tell tales out of school",
        "meaning": "To reveal private or confidential information about someone or something.",
        "examples": [
          "Don't tell tales out of school; what happens in this office stays in this office.",
          "She got into trouble for telling tales out of school about her colleagues."
        ]
      },
      {
        "id": "g59w44",
        "word": "to throw cold water",
        "meaning": "To discourage or dampen enthusiasm for something.",
        "examples": [
          "His negative comments always throw cold water on everyone's ideas.",
          "Don't throw cold water on her dreams; let her try."
        ]
      },
      {
        "id": "g59w45",
        "word": "to throw down the gauntlet",
        "meaning": "To issue a challenge.",
        "examples": [
          "The rival team threw down the gauntlet, challenging them to a final match.",
          "The politician threw down the gauntlet, daring his opponent to a debate."
        ]
      },
      {
        "id": "g59w46",
        "word": "to throw the book at someone",
        "meaning": "To punish someone very severely for an offense.",
        "examples": [
          "The judge threw the book at him for repeated reckless driving.",
          "If you break the law again, they'll throw the book at you."
        ]
      },
      {
        "id": "g59w47",
        "word": "to tighten one's belt",
        "meaning": "To spend less money than usual because there is less available.",
        "examples": [
          "With the recent layoffs, many families are having to tighten their belts.",
          "We'll need to tighten our belts if we want to save for a vacation."
        ]
      },
      {
        "id": "g59w48",
        "word": "to tilt at windmills",
        "meaning": "To attack imaginary enemies or to fight against impossible odds.",
        "examples": [
          "He's always tilting at windmills, pursuing unrealistic goals.",
          "Trying to change the entire system by himself feels like tilting at windmills."
        ]
      },
      {
        "id": "g59w49",
        "word": "to toe the mark",
        "meaning": "To conform to a rule or standard; to obey or comply.",
        "examples": [
          "New employees are expected to toe the mark and follow company policies.",
          "If he doesn't toe the mark, he'll face consequences."
        ]
      },
      {
        "id": "g59w50",
        "word": "to twist around one's finger",
        "meaning": "To manipulate or control someone completely and effortlessly.",
        "examples": [
          "She can twist her father around her little finger to get whatever she wants.",
          "He's so charming, he can twist anyone around his finger."
        ]
      },
      {
        "id": "g59w51",
        "word": "to upset the apple cart",
        "meaning": "To spoil a plan or arrangement.",
        "examples": [
          "His sudden resignation really upset the apple cart for the entire project.",
          "Don't upset the apple cart by bringing up that controversial topic now."
        ]
      },
      {
        "id": "g59w52",
        "word": "to whitewash",
        "meaning": "To cover up or gloss over faults or wrongdoings.",
        "examples": [
          "The government was accused of trying to whitewash the scandal.",
          "They attempted to whitewash the company's negative image with a new advertising campaign."
        ]
      },
      {
        "id": "g59w53",
        "word": "toady",
        "meaning": "A person who praises and helps powerful people in order to get their approval.",
        "examples": [
          "He was known as a toady, always flattering the boss.",
          "She despised the toadies who surrounded the famous celebrity."
        ]
      },
      {
        "id": "g59w54",
        "word": "token",
        "meaning": "A thing serving as a tangible representation of a fact, quality, feeling, etc. Something that represents something else, often as a gesture.",
        "examples": [
          "Please accept this small gift as a token of my appreciation.",
          "He wore a token of remembrance from his travels."
        ]
      },
      {
        "id": "g59w55",
        "word": "tolerate",
        "meaning": "To allow the existence, occurrence, or practice of (something that one does not necessarily like or agree with) without interference. To endure (something unpleasant or difficult) without complaining.",
        "examples": [
          "I can't tolerate rude behavior.",
          "Some plants can tolerate extreme temperatures."
        ]
      },
      {
        "id": "g59w56",
        "word": "tome",
        "meaning": "A book, especially a large, heavy, scholarly one.",
        "examples": [
          "He spent hours studying the ancient tome of forgotten spells.",
          "The professor's office was filled with dusty tomes on various subjects."
        ]
      },
      {
        "id": "g59w57",
        "word": "tongue in cheek",
        "meaning": "Expressing something in a way that appears to be serious but is actually playful or ironic.",
        "examples": [
          "He made a tongue-in-cheek comment about his own cooking skills.",
          "Her entire performance was delivered with a delightful tongue-in-cheek humor."
        ]
      },
      {
        "id": "g59w58",
        "word": "tonic",
        "meaning": "A medicinal substance taken to give a feeling of vigor or well-being. A stimulating or invigorating effect.",
        "examples": [
          "The fresh air was a real tonic after being stuck indoors all day.",
          "She felt the natural tonic of the mountain spring water."
        ]
      },
      {
        "id": "g59w59",
        "word": "tonicity",
        "meaning": "The state of normal tension in living muscles, or in living tissues generally. The osmotic pressure of a solution, usually relative to that of blood.",
        "examples": [
          "The doctor assessed the tonicity of the patient's muscles.",
          "Maintaining proper fluid tonicity is essential for cellular function."
        ]
      },
      {
        "id": "g59w60",
        "word": "toothsome",
        "meaning": "(Of food) delicious or appetizing. (Of a person) attractive or pleasing.",
        "examples": [
          "The bakery offered a display of toothsome pastries.",
          "He enjoyed the toothsome flavor of the homemade stew."
        ]
      }
    ]
  }