{
    "id": "group33",
    "words": [
      {
        "id": "g33w1",
        "word": "intertwined",
        "meaning": "To twist or twine together; to be closely connected.",
        "examples": [
          "The histories of the two countries are deeply intertwined.",
          "The vines were intertwined, forming a thick green canopy."
        ]
      },
      {
        "id": "g33w2",
        "word": "intimate",
        "meaning": "To imply or hint.",
        "examples": [
          "He intimated that he was not happy with the current situation.",
          "She subtly intimated her desire to leave the party early."
        ]
      },
      {
        "id": "g33w3",
        "word": "intimation",
        "meaning": "An indication or hint.",
        "examples": [
          "The first intimation of the coming storm was the dark clouds on the horizon.",
          "He gave no intimation that he was planning to resign."
        ]
      },
      {
        "id": "g33w4",
        "word": "intimidate",
        "meaning": "To frighten or overawe (someone), especially in order to make them do what one wants.",
        "examples": [
          "The bully tried to intimidate the smaller children into giving him their lunch money.",
          "She was not a person who could be easily intimidated."
        ]
      },
      {
        "id": "g33w5",
        "word": "intractable",
        "meaning": "Hard to control or deal with.",
        "examples": [
          "The problem of poverty has proven to be an intractable one for governments worldwide.",
          "The child was intractable and refused to listen to any reasoning."
        ]
      },
      {
        "id": "g33w6",
        "word": "intransigence",
        "meaning": "Refusal to change one's views or to agree about something.",
        "examples": [
          "The negotiations failed due to the intransigence of both parties.",
          "His intransigence on the issue made it impossible to find a compromise."
        ]
      },
      {
        "id": "g33w7",
        "word": "intransigent",
        "meaning": "Unwilling or refusing to change one's views or to agree about something.",
        "examples": [
          "He was an intransigent opponent of any new taxes.",
          "The intransigent leader refused to negotiate with the rebels."
        ]
      },
      {
        "id": "g33w8",
        "word": "intrepid",
        "meaning": "Fearless; adventurous.",
        "examples": [
          "The intrepid explorer set out to cross the Antarctic alone.",
          "A team of intrepid journalists uncovered the government scandal."
        ]
      },
      {
        "id": "g33w9",
        "word": "intricate",
        "meaning": "Very complicated or detailed.",
        "examples": [
          "The watch mechanism was incredibly intricate and delicate.",
          "She wove an intricate plot full of twists and turns."
        ]
      },
      {
        "id": "g33w10",
        "word": "intrigue",
        "meaning": "To arouse the curiosity or interest of; fascinate.",
        "examples": [
          "The mystery surrounding the old mansion intrigued the children.",
          "She was intrigued by the possibility of discovering a new species."
        ]
      },
      {
        "id": "g33w11",
        "word": "intrinsic",
        "meaning": "Belonging naturally; essential.",
        "examples": [
          "The intrinsic value of a diamond comes from its rarity and beauty.",
          "She had an intrinsic motivation to help others."
        ]
      },
      {
        "id": "g33w12",
        "word": "introspection",
        "meaning": "The examination or observation of one's own mental and emotional processes.",
        "examples": [
          "A period of quiet introspection helped him understand his own feelings.",
          "His poetry is known for its deep introspection."
        ]
      },
      {
        "id": "g33w13",
        "word": "introspective",
        "meaning": "Characterized by or given to introspection.",
        "examples": [
          "He was a quiet and introspective man who enjoyed his own company.",
          "The novel is an introspective look at the main character's journey of self-discovery."
        ]
      },
      {
        "id": "g33w14",
        "word": "intrusive",
        "meaning": "Causing disruption or annoyance through being unwelcome or uninvited.",
        "examples": [
          "The reporter's intrusive questions made the celebrity uncomfortable.",
          "The constant noise from the construction site was very intrusive."
        ]
      },
      {
        "id": "g33w15",
        "word": "inundate",
        "meaning": "To overwhelm (someone) with things or people to be dealt with; to flood.",
        "examples": [
          "After the commercial aired, the company was inundated with orders.",
          "The river threatened to inundate the entire town."
        ]
      },
      {
        "id": "g33w16",
        "word": "inundated",
        "meaning": "Overwhelmed with a large amount of something.",
        "examples": [
          "We were inundated with applications for the single job opening.",
          "The coastal village was inundated by the tsunami."
        ]
      },
      {
        "id": "g33w17",
        "word": "inure",
        "meaning": "To accustom (someone) to something, especially something unpleasant.",
        "examples": [
          "Working in the emergency room will inure you to the sight of blood.",
          "The harsh training was meant to inure the soldiers to hardship."
        ]
      },
      {
        "id": "g33w18",
        "word": "inured",
        "meaning": "Accustomed to something, especially something unpleasant.",
        "examples": [
          "The doctors were inured to the suffering they saw every day.",
          "After years of criticism, she was inured to the negative comments."
        ]
      },
      {
        "id": "g33w19",
        "word": "invalidate",
        "meaning": "To make (an argument, statement, or theory) unsound; to make legally void.",
        "examples": [
          "A single contradictory fact can invalidate an entire scientific theory.",
          "Failure to sign the contract will invalidate the agreement."
        ]
      },
      {
        "id": "g33w20",
        "word": "invasive",
        "meaning": "(Especially of a plant or disease) tending to spread prolifically and harmfully.",
        "examples": [
          "The invasive species of ivy is killing native trees.",
          "The doctors recommended a less invasive surgical procedure."
        ]
      },
      {
        "id": "g33w21",
        "word": "invective",
        "meaning": "Insulting, abusive, or highly critical language.",
        "examples": [
          "The politician's speech was filled with bitter invective against his opponents.",
          "He shouted a stream of invective at the driver who cut him off."
        ]
      },
      {
        "id": "g33w22",
        "word": "inveigle",
        "meaning": "To persuade (someone) to do something by means of deception or flattery.",
        "examples": [
          "He tried to inveigle his way into the exclusive club.",
          "She inveigled him into giving her his password."
        ]
      },
      {
        "id": "g33w23",
        "word": "invert",
        "meaning": "To put upside down or in the opposite position, order, or arrangement.",
        "examples": [
          "If you invert the numbers, you get the correct answer.",
          "He inverted the glass to let it dry."
        ]
      },
      {
        "id": "g33w24",
        "word": "investiture",
        "meaning": "The action of formally investing a person with honors or rank.",
        "examples": [
          "The investiture ceremony for the new knights was a grand affair.",
          "The judge's investiture was attended by many prominent legal figures."
        ]
      },
      {
        "id": "g33w25",
        "word": "inveterate",
        "meaning": "Having a particular habit, activity, or interest that is long-established and unlikely to change.",
        "examples": [
          "He was an inveterate gambler who could not stay away from the casino.",
          "She is an inveterate reader who always has a book with her."
        ]
      },
      {
        "id": "g33w26",
        "word": "invidious",
        "meaning": "(Of an action or situation) likely to arouse or incur resentment or anger in others.",
        "examples": [
          "It is an invidious task to have to choose just one winner from so many talented artists.",
          "She put her employees in an invidious position by asking them to report on each other."
        ]
      },
      {
        "id": "g33w27",
        "word": "invigorate",
        "meaning": "To give strength or energy to.",
        "examples": [
          "The cold shower invigorated him after a long night.",
          "The new manager's enthusiasm invigorated the tired team."
        ]
      },
      {
        "id": "g33w28",
        "word": "inviolable",
        "meaning": "Never to be broken, infringed, or dishonored.",
        "examples": [
          "The priest considered his vow to be inviolable.",
          "The treaty established an inviolable border between the two countries."
        ]
      },
      {
        "id": "g33w29",
        "word": "inviolate",
        "meaning": "Free or safe from injury or violation.",
        "examples": [
          "The ancient tomb remained inviolate for thousands of years.",
          "She was determined to keep her promise inviolate."
        ]
      },
      {
        "id": "g33w30",
        "word": "invoke",
        "meaning": "To cite or appeal to (someone or something) as an authority for an action or in support of an argument.",
        "examples": [
          "He invoked his right to remain silent.",
          "The shaman would invoke the spirits for guidance."
        ]
      },
      {
        "id": "g33w31",
        "word": "involute",
        "meaning": "Complicated or abstruse.",
        "examples": [
          "The philosopher's involute arguments were difficult for his students to follow.",
          "He gave an involute explanation that only confused the matter further."
        ]
      },
      {
        "id": "g33w32",
        "word": "involved",
        "meaning": "Difficult to comprehend; complicated.",
        "examples": [
          "The plot of the movie was too involved for me to follow.",
          "He gave a long and involved explanation."
        ]
      },
      {
        "id": "g33w33",
        "word": "invulnerable",
        "meaning": "Impossible to harm or damage.",
        "examples": [
          "The mythical hero was said to be invulnerable to any weapon.",
          "He believed his high-tech security system made his home invulnerable."
        ]
      },
      {
        "id": "g33w34",
        "word": "irascible",
        "meaning": "Having or showing a tendency to be easily angered.",
        "examples": [
          "The irascible old man yelled at the children to get off his lawn.",
          "He was known for his irascible temper."
        ]
      },
      {
        "id": "g33w35",
        "word": "irate",
        "meaning": "Feeling or characterized by great anger.",
        "examples": [
          "The irate customer demanded to speak to a manager.",
          "She was irate about the poor service she received."
        ]
      },
      {
        "id": "g33w36",
        "word": "ire",
        "meaning": "Anger.",
        "examples": [
          "His controversial comments drew the ire of the public.",
          "She was filled with ire at the injustice of the situation."
        ]
      },
      {
        "id": "g33w37",
        "word": "irk",
        "meaning": "To irritate; annoy.",
        "examples": [
          "It irks me when people talk loudly on their phones in public.",
          "His constant humming began to irk his coworkers."
        ]
      },
      {
        "id": "g33w38",
        "word": "irksome",
        "meaning": "Irritating; annoying.",
        "examples": [
          "The irksome task of cleaning the oven took hours.",
          "He found the constant interruptions to be very irksome."
        ]
      },
      {
        "id": "g33w39",
        "word": "ironclad",
        "meaning": "Impossible to contradict, weaken, or change.",
        "examples": [
          "He had an ironclad alibi for the night of the crime.",
          "The company required all employees to sign an ironclad confidentiality agreement."
        ]
      },
      {
        "id": "g33w40",
        "word": "ironic",
        "meaning": "Happening in the opposite way to what is expected, and typically causing wry amusement because of this.",
        "examples": [
          "It was ironic that the fire station burned down.",
          "In an ironic twist, the thief's getaway car was stolen."
        ]
      },
      {
        "id": "g33w41",
        "word": "irony",
        "meaning": "The expression of one's meaning by using language that normally signifies the opposite, typically for humorous effect.",
        "examples": [
          "The irony of her saying 'What a beautiful day!' during the hurricane was not lost on him.",
          "He had a keen sense of irony that made his stories very amusing."
        ]
      },
      {
        "id": "g33w42",
        "word": "irrational",
        "meaning": "Not logical or reasonable.",
        "examples": [
          "His fear of spiders was completely irrational.",
          "It is irrational to expect a different result while doing the same thing over and over."
        ]
      },
      {
        "id": "g33w43",
        "word": "irrefutable",
        "meaning": "Impossible to deny or disprove.",
        "examples": [
          "The video footage provided irrefutable evidence of his guilt.",
          "The scientific community accepted the theory as irrefutable."
        ]
      },
      {
        "id": "g33w44",
        "word": "irrelevant",
        "meaning": "Not connected with or relevant to something.",
        "examples": [
          "His personal opinion is irrelevant to the facts of the case.",
          "The witness's testimony was dismissed as irrelevant."
        ]
      },
      {
        "id": "g33w45",
        "word": "irresolute",
        "meaning": "Showing or feeling hesitancy; uncertain.",
        "examples": [
          "He was irresolute about which college to attend.",
          "The irresolute commander could not make a decision."
        ]
      },
      {
        "id": "g33w46",
        "word": "irreverent",
        "meaning": "Showing a lack of respect for people or things that are generally taken seriously.",
        "examples": [
          "The comedian was known for his irreverent humor.",
          "His irreverent attitude often got him into trouble at the conservative school."
        ]
      },
      {
        "id": "g33w47",
        "word": "irrevocable",
        "meaning": "Not able to be changed, reversed, or recovered; final.",
        "examples": [
          "His decision to resign was irrevocable.",
          "Signing the contract has irrevocable consequences."
        ]
      },
      {
        "id": "g33w48",
        "word": "it's an ill wind that blows nobody good",
        "meaning": "A proverb meaning that few things are so bad that they do not benefit someone.",
        "examples": [
          "The factory closure was devastating, but for the local scrapyard, it's an ill wind that blows nobody good.",
          "When the lead actor broke his leg, the understudy got his big break; it's an ill wind that blows nobody good."
        ]
      },
      {
        "id": "g33w49",
        "word": "itinerant",
        "meaning": "Traveling from place to place.",
        "examples": [
          "The itinerant farm workers followed the harvest season.",
          "He lived an itinerant lifestyle, never staying in one city for long."
        ]
      },
      {
        "id": "g33w50",
        "word": "itinerary",
        "meaning": "A planned route or journey.",
        "examples": [
          "Our itinerary includes visits to Paris, Rome, and Athens.",
          "The tour guide handed out the itinerary for the day."
        ]
      },
      {
        "id": "g33w51",
        "word": "ivory tower",
        "meaning": "A state of privileged seclusion or separation from the facts and practicalities of the real world.",
        "examples": [
          "The professor was accused of living in an ivory tower, disconnected from the problems of ordinary people.",
          "Politicians need to come down from their ivory towers and listen to the voters."
        ]
      },
      {
        "id": "g33w52",
        "word": "jamb",
        "meaning": "A side post or surface of a doorway, window, or fireplace.",
        "examples": [
          "He leaned against the door jamb while he waited.",
          "She painted the window jambs white to match the trim."
        ]
      },
      {
        "id": "g33w53",
        "word": "jargon",
        "meaning": "Special words or expressions used by a particular profession or group that are difficult for others to understand.",
        "examples": [
          "The doctor's explanation was full of medical jargon that I didn't understand.",
          "Legal documents are often filled with impenetrable jargon."
        ]
      },
      {
        "id": "g33w54",
        "word": "jaundice",
        "meaning": "A feeling of bitterness, resentment, or envy.",
        "examples": [
          "He looked upon his rival's success with an eye of jaundice.",
          "Her years of disappointment had filled her with a deep sense of jaundice."
        ]
      },
      {
        "id": "g33w55",
        "word": "jaundiced",
        "meaning": "Having or showing bitterness, resentment, or cynicism.",
        "examples": [
          "He has a jaundiced view of politics and doesn't trust any politician.",
          "After being lied to so many times, she had a jaundiced perspective on relationships."
        ]
      },
      {
        "id": "g33w56",
        "word": "jaunty",
        "meaning": "Having or expressing a lively, cheerful, and self-confident manner.",
        "examples": [
          "He walked with a jaunty step, whistling a happy tune.",
          "She wore a jaunty little hat tilted to one side."
        ]
      },
      {
        "id": "g33w57",
        "word": "jeer",
        "meaning": "To make rude and mocking remarks, typically in a loud voice.",
        "examples": [
          "The crowd began to jeer at the opposing team.",
          "He tried to ignore the jeers from his critics."
        ]
      },
      {
        "id": "g33w58",
        "word": "jejune",
        "meaning": "Naive, simplistic, and superficial; dry and uninteresting.",
        "examples": [
          "He made some jejune comments that showed his lack of understanding.",
          "The professor's lecture on the topic was unfortunately jejune and uninspiring."
        ]
      },
      {
        "id": "g33w59",
        "word": "jeopardize",
        "meaning": "To put (someone or something) into a situation in which there is a danger of loss, harm, or failure.",
        "examples": [
          "His reckless behavior could jeopardize the entire project.",
          "Don't jeopardize your health by smoking."
        ]
      },
      {
        "id": "g33w60",
        "word": "jeopardy",
        "meaning": "Danger of loss, harm, or failure.",
        "examples": [
          "The company's future is in jeopardy if sales don't improve.",
          "The climbers were in great jeopardy when the storm hit."
        ]
      }
    ]
  }