{
    "id": "group30",
    "words": [
      {
        "id": "g30w1",
        "word": "implicate",
        "meaning": "To show (someone) to be involved in a crime or wrongdoing.",
        "examples": [
          "The evidence seemed to implicate him in the robbery.",
          "The witness's testimony could implicate several high-ranking officials."
        ]
      },
      {
        "id": "g30w2",
        "word": "implication",
        "meaning": "The conclusion that can be drawn from something, although it is not explicitly stated.",
        "examples": [
          "The implication of his silence was that he agreed with the decision.",
          "They are studying the long-term implications of the new policy."
        ]
      },
      {
        "id": "g30w3",
        "word": "implicit",
        "meaning": "Suggested though not directly expressed.",
        "examples": [
          "They had an implicit understanding that they would help each other.",
          "There was an implicit threat in his calm voice."
        ]
      },
      {
        "id": "g30w4",
        "word": "implode",
        "meaning": "To collapse or cause to collapse violently inward.",
        "examples": [
          "The old building was scheduled to implode on Sunday morning.",
          "The company began to implode under the weight of its massive debt."
        ]
      },
      {
        "id": "g30w5",
        "word": "implore",
        "meaning": "To beg someone earnestly or desperately to do something.",
        "examples": [
          "She implored the judge for mercy.",
          "I implore you to reconsider your hasty decision."
        ]
      },
      {
        "id": "g30w6",
        "word": "imploring",
        "meaning": "Making an earnest or desperate appeal.",
        "examples": [
          "The child looked up at her mother with an imploring gaze.",
          "He sent her one last imploring text message, but she did not reply."
        ]
      },
      {
        "id": "g30w7",
        "word": "imponderable",
        "meaning": "A factor that is difficult or impossible to estimate or assess.",
        "examples": [
          "The outcome of the election depends on several imponderable factors.",
          "Human emotion is the great imponderable in any marketing strategy."
        ]
      },
      {
        "id": "g30w8",
        "word": "importune",
        "meaning": "To ask (someone) pressingly and persistently for or to do something.",
        "examples": [
          "He would constantly importune his friends for money.",
          "The reporters continued to importune the grieving family for an interview."
        ]
      },
      {
        "id": "g30w9",
        "word": "importuned",
        "meaning": "Asked (someone) pressingly and persistently for or to do something.",
        "examples": [
          "He importuned her for a second chance, but she refused to listen.",
          "The charity importuned passersby for donations."
        ]
      },
      {
        "id": "g30w10",
        "word": "imposture",
        "meaning": "An instance of pretending to be someone else in order to deceive others.",
        "examples": [
          "His claim to be a long-lost heir was revealed to be a clever imposture.",
          "He was a master of imposture, with several different identities across the country."
        ]
      },
      {
        "id": "g30w11",
        "word": "imprecation",
        "meaning": "A spoken curse.",
        "examples": [
          "He muttered a stream of imprecations under his breath as he walked away.",
          "The witch hurled a terrible imprecation at the villagers who had wronged her."
        ]
      },
      {
        "id": "g30w12",
        "word": "impregnable",
        "meaning": "(Of a fortified position) unable to be captured or broken into.",
        "examples": [
          "The castle's defenses were considered impregnable.",
          "Her argument was impregnable, and no one could find a flaw in it."
        ]
      },
      {
        "id": "g30w13",
        "word": "impresario",
        "meaning": "A person who organizes and often finances concerts, plays, or operas.",
        "examples": [
          "The famous impresario brought the world's best ballet troupe to the city.",
          "He had a long and successful career as a theatrical impresario."
        ]
      },
      {
        "id": "g30w14",
        "word": "imprimatur",
        "meaning": "A person's authoritative approval or sanction.",
        "examples": [
          "The project cannot proceed until it has the board's imprimatur.",
          "The new policy received the imprimatur of the director."
        ]
      },
      {
        "id": "g30w15",
        "word": "improbable",
        "meaning": "Not likely to be true or to happen.",
        "examples": [
          "It seems improbable that he could have completed the marathon without any training.",
          "The team made an improbable comeback to win the championship."
        ]
      },
      {
        "id": "g30w16",
        "word": "impromptu",
        "meaning": "Done without being planned, organized, or rehearsed.",
        "examples": [
          "He gave a witty impromptu speech at the wedding.",
          "We decided to have an impromptu picnic in the park."
        ]
      },
      {
        "id": "g30w17",
        "word": "improvident",
        "meaning": "Not having or showing foresight; spendthrift or thoughtless.",
        "examples": [
          "His improvident spending left him with no savings for retirement.",
          "The government was criticized for its improvident handling of the natural resources."
        ]
      },
      {
        "id": "g30w18",
        "word": "improvise",
        "meaning": "To create and perform spontaneously or without preparation; to produce something from whatever is available.",
        "examples": [
          "The actor had to improvise his lines when he forgot the script.",
          "We had to improvise a meal from the few ingredients left in the fridge."
        ]
      },
      {
        "id": "g30w19",
        "word": "imprudence",
        "meaning": "The quality of being imprudent; lack of caution or care for consequences.",
        "examples": [
          "The imprudence of his financial decisions led to his eventual bankruptcy.",
          "She immediately regretted her imprudence in trusting a complete stranger with her keys."
        ]
      },
      {
        "id": "g30w20",
        "word": "imprudent",
        "meaning": "Not showing care for the consequences of an action; rash.",
        "examples": [
          "It would be imprudent to invest all your money in one volatile stock.",
          "He made the imprudent decision to go sailing during the storm."
        ]
      },
      {
        "id": "g30w21",
        "word": "impudence",
        "meaning": "The quality of being impudent; impertinence or disrespect.",
        "examples": [
          "The student was punished for his impudence towards the teacher.",
          "I was shocked by the sheer impudence of her demands."
        ]
      },
      {
        "id": "g30w22",
        "word": "impudent",
        "meaning": "Not showing due respect for another person; impertinent.",
        "examples": [
          "The impudent child talked back to his elders.",
          "He asked an impudent question that left everyone in the room speechless."
        ]
      },
      {
        "id": "g30w23",
        "word": "impugn",
        "meaning": "To dispute the truth, validity, or honesty of (a statement or motive); call into question.",
        "examples": [
          "I do not mean to impugn your integrity, but I must see the evidence for myself.",
          "The defense lawyer tried to impugn the witness's character during cross-examination."
        ]
      },
      {
        "id": "g30w24",
        "word": "impunity",
        "meaning": "Exemption from punishment or freedom from the injurious consequences of an action.",
        "examples": [
          "He believed his wealth and influence would allow him to commit crimes with impunity.",
          "The dictator ruled with absolute impunity for decades."
        ]
      },
      {
        "id": "g30w25",
        "word": "impute",
        "meaning": "To represent (something, especially something undesirable) as being done, caused, or possessed by someone; attribute.",
        "examples": [
          "The police imputed the crime to the notorious gangster.",
          "She tried to impute her own mistakes to her junior colleague."
        ]
      },
      {
        "id": "g30w26",
        "word": "in a bee line",
        "meaning": "In a straight, direct course.",
        "examples": [
          "As soon as school was out, he made a bee line for the ice cream truck.",
          "The dog ran in a bee line to its owner as soon as it saw him."
        ]
      },
      {
        "id": "g30w27",
        "word": "in apple pie order",
        "meaning": "In perfect order; extremely neat and tidy.",
        "examples": [
          "She always kept her desk and files in apple pie order.",
          "Before the guests arrived, the whole house was in apple pie order."
        ]
      },
      {
        "id": "g30w28",
        "word": "in seventh heaven",
        "meaning": "In a state of supreme happiness or delight.",
        "examples": [
          "She was in seventh heaven after receiving the promotion she had worked so hard for.",
          "When he won the lottery, he was in seventh heaven for weeks."
        ]
      },
      {
        "id": "g30w29",
        "word": "in the arms of Morpheus",
        "meaning": "Asleep.",
        "examples": [
          "After the long and tiring journey, he was soon in the arms of Morpheus.",
          "The lullaby finally sent the restless baby into the arms of Morpheus."
        ]
      },
      {
        "id": "g30w30",
        "word": "in the doldrums",
        "meaning": "In a state of stagnation, inactivity, or depression.",
        "examples": [
          "The stock market has been in the doldrums for the past few months.",
          "After his business failed, he was in the doldrums for a long time."
        ]
      },
      {
        "id": "g30w31",
        "word": "in the lap of the gods",
        "meaning": "Beyond human control and therefore subject to fate or chance.",
        "examples": [
          "We've done all we can to prepare; the outcome of the match is now in the lap of the gods.",
          "Whether our flight will be canceled due to the storm is in the lap of the gods."
        ]
      },
      {
        "id": "g30w32",
        "word": "inadvertent",
        "meaning": "Not resulting from or achieved through deliberate planning; unintentional.",
        "examples": [
          "His inadvertent comment during the meeting caused a great deal of embarrassment.",
          "It was an inadvertent error in the report, but it had serious consequences."
        ]
      },
      {
        "id": "g30w33",
        "word": "inadvertently",
        "meaning": "Without intention; accidentally.",
        "examples": [
          "She inadvertently deleted the important presentation file.",
          "He inadvertently revealed the surprise party plans to the guest of honor."
        ]
      },
      {
        "id": "g30w34",
        "word": "inalienable",
        "meaning": "Unable to be taken away from or given away by the possessor.",
        "examples": [
          "The declaration states that all people have certain inalienable rights, including life and liberty.",
          "Freedom of speech is considered an inalienable right in a true democracy."
        ]
      },
      {
        "id": "g30w35",
        "word": "inane",
        "meaning": "Silly; stupid; lacking sense or meaning.",
        "examples": [
          "They were laughing hysterically at some inane joke.",
          "He kept asking inane questions during the serious lecture."
        ]
      },
      {
        "id": "g30w36",
        "word": "inanimate",
        "meaning": "Not alive, especially not in the manner of animals and humans.",
        "examples": [
          "A rock is an inanimate object.",
          "The child often talked to her toys as if they were not inanimate."
        ]
      },
      {
        "id": "g30w37",
        "word": "inanity",
        "meaning": "The quality of being inane; a nonsensical remark or action.",
        "examples": [
          "I couldn't listen to the sheer inanity of their conversation any longer.",
          "The film was a collection of cheap jokes and utter inanity."
        ]
      },
      {
        "id": "g30w38",
        "word": "inarticulate",
        "meaning": "Unable to express one's ideas or feelings clearly or easily.",
        "examples": [
          "He was so overcome with emotion that he was rendered completely inarticulate.",
          "His inarticulate grunts and gestures were the only response he could manage."
        ]
      },
      {
        "id": "g30w39",
        "word": "inasmuch",
        "meaning": "In view of the fact that; seeing that; since.",
        "examples": [
          "Inasmuch as you are my friend, I feel I can confide in you.",
          "The project was a success, inasmuch as it met all of its primary objectives."
        ]
      },
      {
        "id": "g30w40",
        "word": "inauspicious",
        "meaning": "Not conducive to success; unpromising.",
        "examples": [
          "The project got off to an inauspicious start with a major budget cut.",
          "The constant rain was an inauspicious sign for the outdoor festival."
        ]
      },
      {
        "id": "g30w41",
        "word": "inborn",
        "meaning": "Natural to a person or animal; innate.",
        "examples": [
          "She seems to have an inborn talent for painting.",
          "The desire to survive is an inborn instinct in all living creatures."
        ]
      },
      {
        "id": "g30w42",
        "word": "incandescent",
        "meaning": "Emitting light as a result of being heated; full of strong emotion; brilliant.",
        "examples": [
          "An incandescent light bulb works by heating a thin filament.",
          "She gave an incandescent performance that captivated the entire audience."
        ]
      },
      {
        "id": "g30w43",
        "word": "incapacitated",
        "meaning": "Prevented from functioning in a normal way; deprived of capacity or natural power.",
        "examples": [
          "He was incapacitated by a severe leg injury and couldn't work for months.",
          "The powerful storm incapacitated the city's transportation network."
        ]
      },
      {
        "id": "g30w44",
        "word": "incarnate",
        "meaning": "(Especially of a deity or spirit) embodied in flesh; in human form.",
        "examples": [
          "The dictator was seen by his oppressed people as evil incarnate.",
          "She is the very picture of kindness and generosity incarnate."
        ]
      },
      {
        "id": "g30w45",
        "word": "incendiary",
        "meaning": "(Of a device or attack) designed to cause fires; tending to stir up conflict.",
        "examples": [
          "The arsonist used an incendiary device to start the blaze.",
          "His incendiary speech was designed to provoke the crowd to violence."
        ]
      },
      {
        "id": "g30w46",
        "word": "incense",
        "meaning": "To make very angry.",
        "examples": [
          "The politician's dishonest remarks were enough to incense the public.",
          "His blatant disregard for the rules will incense his superiors."
        ]
      },
      {
        "id": "g30w47",
        "word": "incensed",
        "meaning": "Very angry; enraged.",
        "examples": [
          "She was absolutely incensed by the unfair accusation.",
          "The incensed customer demanded a full refund."
        ]
      },
      {
        "id": "g30w48",
        "word": "incentive",
        "meaning": "A thing that motivates or encourages one to do something.",
        "examples": [
          "The company offered a financial incentive for employees who met their sales targets.",
          "The chance to win a scholarship was a great incentive to study hard."
        ]
      },
      {
        "id": "g30w49",
        "word": "incessant",
        "meaning": "(Of something regarded as unpleasant) continuing without pause or interruption.",
        "examples": [
          "The incessant noise from the construction site made it impossible to concentrate.",
          "She grew tired of his incessant complaints about everything."
        ]
      },
      {
        "id": "g30w50",
        "word": "inchoate",
        "meaning": "Just begun and so not fully formed or developed; rudimentary.",
        "examples": [
          "She had an inchoate idea for a business, but it needed much more development.",
          "The political movement was still inchoate and lacked a clear leader."
        ]
      },
      {
        "id": "g30w51",
        "word": "incidence",
        "meaning": "The occurrence, rate, or frequency of a disease, crime, or something else undesirable.",
        "examples": [
          "The study analyzed the incidence of lung cancer among smokers.",
          "There has been a high incidence of burglaries in this area recently."
        ]
      },
      {
        "id": "g30w52",
        "word": "incidental",
        "meaning": "Accompanying but not a major part of something; happening by chance in connection with something else.",
        "examples": [
          "He mentioned it as an incidental detail, but it turned out to be crucial.",
          "Your travel budget should account for incidental expenses like souvenirs and tips."
        ]
      },
      {
        "id": "g30w53",
        "word": "incipient",
        "meaning": "In an initial stage; beginning to happen or develop.",
        "examples": [
          "He could feel the first signs of an incipient cold.",
          "The project is still in its incipient stages, but it shows great promise."
        ]
      },
      {
        "id": "g30w54",
        "word": "incisive",
        "meaning": "(Of a person or mental process) intelligently analytical and clear-thinking.",
        "examples": [
          "She was known for her incisive questions and sharp wit.",
          "His incisive analysis of the problem helped us to find a quick solution."
        ]
      },
      {
        "id": "g30w55",
        "word": "inclement",
        "meaning": "(Of the weather) unpleasantly cold or wet.",
        "examples": [
          "Due to the inclement weather, the outdoor concert was postponed.",
          "We decided to stay indoors all day during the inclement weather."
        ]
      },
      {
        "id": "g30w56",
        "word": "inclined",
        "meaning": "Willing or disposed to do something; having a natural tendency to do or be something.",
        "examples": [
          "I am inclined to agree with your assessment of the situation.",
          "He is inclined to be rather lazy on the weekends."
        ]
      },
      {
        "id": "g30w57",
        "word": "incoherent",
        "meaning": "(Of spoken or written language) expressed in a confusing way; unclear.",
        "examples": [
          "He was so upset that his speech became completely incoherent.",
          "She scribbled a few incoherent notes on the back of an envelope."
        ]
      },
      {
        "id": "g30w58",
        "word": "incompatibility",
        "meaning": "The state of two things being so different in nature as to be incapable of coexisting.",
        "examples": [
          "Their frequent arguments were a result of their basic incompatibility.",
          "There was a fundamental incompatibility between his career ambitions and her desire for a quiet life."
        ]
      },
      {
        "id": "g30w59",
        "word": "inconclusive",
        "meaning": "Not leading to a firm conclusion; not ending doubt or dispute.",
        "examples": [
          "The results of the scientific experiment were inconclusive.",
          "After hours of debate, the meeting regarding the new proposal was inconclusive."
        ]
      },
      {
        "id": "g30w60",
        "word": "incongruity",
        "meaning": "The state of being out of keeping or not in harmony.",
        "examples": [
          "There was a strange incongruity in seeing the serious lawyer in a clown costume.",
          "The incongruity of a high-tech skyscraper in the middle of a historic village was jarring."
        ]
      }
    ]
  }